[
  {
    "title": "The Carbon Credit Revolution: The Currency Of The Future",
    "link": "https://edciitdelhi.substack.com/p/the-carbon-credit-revolution-the",
    "published": "Mon, 04 Nov 2024 15:33:09 GMT",
    "content": "Imagine you're making choices that not only benefit your life but also contribute to a healthier planet. What if, in return for your eco-friendly actions, you received a new kind of currency? How would you use it? Could trading these rewards become the key to both environmental sustainability and financial innovation? Welcome to the world of carbon credits and their potential as a new cryptocurrency.\nThe Story Continues: Mr. X and the Carbon Credit Revolution\nAs we last left Mr. X, he had just begun to dip his toes into the world of ESG (Environmental, Social, and Governance) investing. His eyes had been opened to the impact that his investments could have on the planet, and he was determined to make a positive change. But as he delved deeper into the world of sustainable investing, he stumbled upon a concept that left him both intrigued and perplexed: carbon credits.\nHe discovered that a carbon credit is essentially a certificate that represents the right to emit a certain amount of greenhouse gases, such as carbon dioxide or methane. These credits are issued by governments or independent organizations to companies or individuals who have reduced their emissions or invested in projects that reduce emissions.\nBut here's the twist: these credits can be traded on the open market. Companies or individuals who have excess credits can sell them to those who need them to offset their own emissions. This is where the concept of carbon trading comes in.\nMr. X's eyes widened as he realized the potential of carbon trading. \"This is like a whole new asset class!\" he exclaimed. He envisioned a world where companies and individuals could buy and sell carbon credits like stocks or bonds.\nUnderstanding Carbon Credits\nAt its core, a carbon credit is a permit that represents the right to emit one metric ton of carbon dioxide or its equivalent in other greenhouse gases. For every ton of CO2 emissions a company or individual reduces, they earn a carbon credit. These credits can then be traded or sold, allowing those who can't reduce their emissions as effectively to buy credits from those who have excess.\nHow Carbon Credits Work\nEmission Reduction Projects (ERPs):\nEmission Reduction Projects (ERPs) are initiatives designed to reduce greenhouse gas emissions and mitigate the impact of climate change. These projects involve a range of activities, including the adoption of renewable energy sources, implementation of energy-efficient technologies, sustainable land use practices, and waste management strategies. By reducing emissions, ERPs contribute to global efforts to combat climate change while also providing benefits to local communities through improved air quality, job creation, and enhanced environmental sustainability. ERPs can be implemented in various sectors, including energy, industry, agriculture, and forestry, and can be tailored to suit the specific needs and circumstances of different regions and communities.\nCertification and Issuance:\nIn India, Emission Reduction Projects (ERPs) undergo a rigorous certification and issuance process to ensure their authenticity and environmental integrity. The Indian government has established a framework for the certification and issuance of ERPs, which involves the validation of project designs, monitoring of project implementation, and verification of emission reductions. The Bureau of Energy Efficiency (BEE) plays a key role in this process, serving as the nodal agency for the certification and issuance of ERPs. Upon successful verification, ERPs are issued with carbon credit certificates, which can be traded on carbon markets. The certification and issuance process is overseen by the Designated National Authority (DNA) and the United Nations Framework Convention on Climate Change (UNFCCC).\nTrading and Selling:\nOnce certified, ERPs can be traded and sold on carbon markets. Companies exceeding their emission reduction targets can sell surplus credits to those needing to offset emissions.\nUnderstanding Carbon Markets:\nCarbon markets play a key role in helping us combat climate change by providing a way for companies to manage their carbon dioxide (CO₂) emissions. These markets are divided into two main types: the Mandatory Market, also known as the Regulatory Market, and the Voluntary Market. Let’s explore each of them and see how they work.\nThe Mandatory (Regulatory) Market:\nIn the Mandatory Market, governments or regulatory bodies set a cap on the amount of CO₂ that certain companies are allowed to emit. This system is a way of enforcing environmental responsibility. Each company has a CO₂ limit, called a CO₂ cap, which they are required to stay within. If a company produces more CO₂ than the cap allows, these extra emissions are labeled as excess CO₂ emissions (shown in orange in the image). To continue operating legally, companies with excess emissions must purchase carbon credits — a kind of permit that allows them to go over their cap.\nOn the other hand, if a company emits less than its CO₂ cap, they generate reduced CO₂ emissions (shown in gray in the image). This gives them the opportunity to sell their unused carbon credits to other companies. In this way, companies that can reduce emissions below their cap are rewarded, while those who exceed the cap are incentivized to cut down emissions in the future.\nThe Mandatory Market encourages companies to either keep emissions within limits or offset their environmental impact by buying credits. This market is enforced by regulations, making participation mandatory for certain companies.\nThe Voluntary Market:\nThe Voluntary Market, shown in the bottom half of the image, works differently. In this market, companies and individuals choose to reduce their CO₂ emissions, even if they aren’t legally required to. This market is often used by companies aiming to improve their environmental footprint or reach sustainability goals, not because of regulations but out of a desire to contribute positively to the environment.\nFor example, if a company wants to reduce its environmental impact, it can purchase carbon credits that represent an expected CO₂ reduction. These credits might support projects that cut down on emissions, like wind farms or tree-planting efforts, both of which help to reduce CO₂ levels. By buying these credits, the company is effectively funding projects that counterbalance their own emissions, even if they don’t have a mandatory CO₂ cap to meet.\nIn the Voluntary Market, companies or individuals can also sell expected CO₂ reductions. If they have a project, like a renewable energy installation, that reduces emissions, they can earn credits that can then be sold to others looking to offset their own emissions.\nKey Takeaway\nBoth the Mandatory and Voluntary Markets serve the same ultimate goal — reducing overall CO₂ emissions. In the Mandatory Market, companies are required by law to manage their emissions, and carbon credits help them stay within set limits. In the Voluntary Market, participation is optional and driven by a commitment to sustainability. Through both markets, companies can play a part in helping the environment, whether by meeting regulatory requirements or by choosing to offset their emissions through positive contributions.\nCarbon Credits as an Incoming New Currency\nMr. X started to see carbon credits as more than just a way to reduce emissions—they could become a new kind of currency. Imagine earning credits for making eco-friendly choices and using them to buy things. What if companies started trading carbon credits like money? This idea, once unusual, is now gaining attention.\nKlimaDAO: Revolutionizing Carbon Credits with Crypto\nOne of the pioneers in this movement is \nKlimaDAO\n, a decentralized platform that integrates carbon credits with cryptocurrency. By using KLIMA tokens, which are backed by real carbon credits, KlimaDAO allows anyone to invest in and trade carbon credits directly on the blockchain. Each KLIMA token represents a measurable amount of CO₂ removed from the atmosphere, supporting projects such as renewable energy, reforestation, and conservation efforts. Through tokenization, KlimaDAO makes it easier for individuals and companies to access and contribute to these projects, driving demand for sustainable initiatives.\nKlimaDAO’s treasury model locks away carbon credits, reducing their availability on the open market. This controlled supply increases the value of carbon credits, providing a financial incentive for companies to pursue climate-friendly projects. By linking environmental action with market-based rewards, KlimaDAO helps turn sustainability into a viable financial strategy. Their blockchain-based approach ensures transparency, allowing anyone to verify the credits’ origin and impact, addressing concerns about fraud and double-counting that have challenged traditional carbon markets.\nToward a Carbon-Based Economy\nImagine a future where carbon credits are used just like currency, creating a circular economy driven by eco-conscious choices. In this future, businesses might accept carbon credits as payment, reflecting their commitment to reducing emissions. Companies would be incentivized to keep emissions low, knowing that any reductions translate into credits they can sell or use. Consumers could earn carbon credits for choosing sustainable products or services, creating a world where everyday actions contribute directly to climate goals.\nIn this carbon-based economy, governments might offer carbon credits as rewards for environmentally responsible behavior, like driving electric vehicles or using solar power. Businesses could pay for resources and services with carbon credits, linking supply chains to sustainable practices. By integrating carbon credits into daily transactions, we can build a world where the economy supports environmental health and rewards sustainability.\nConclusion: The Carbon Credit Revolution and Its Future\nThe potential of carbon credits as a new currency is no longer a distant concept but a burgeoning reality. As Mr. X continues to dive deeper into the world of sustainable investing, he uncovers the profound intersection between financial markets and environmental responsibility. Carbon credits, once a mere tool for offsetting emissions, are now seen as a valuable asset that can be traded, sold, and even integrated into cryptocurrency markets. \nPlatforms like KlimaDAO are leading the charge by making carbon credits more transparent and accessible through blockchain technology, allowing individuals and businesses alike to take part in the climate fight while profiting from it. As carbon credits become more mainstream, they could indeed transform into a new form of currency, driving both sustainability and economic growth.\nUltimately, the integration of carbon credits into everyday life not only encourages eco-friendly actions but also presents a powerful solution for mitigating climate change. In this future, the currency of carbon might just hold the key to unlocking a greener, more sustainable planet while empowering individuals and corporations to contribute to environmental preservation in meaningful and innovative ways.\nAdditional Reading:\nhttps://www.grandviewresearch.com/industry-analysis/carbon-credit-validation-verification-certification-market-report"
  },
  {
    "title": "Harnessing Immersive Technology: The Growing Influence of Virtual Reality in Mental Health Treatment",
    "link": "https://edciitdelhi.substack.com/p/harnessing-immersive-technology-the",
    "published": "Thu, 24 Oct 2024 16:31:05 GMT",
    "content": "Virtual reality is most known for being used for entertainment, but virtual reality has now become more than just fun and games. It is becoming popular in the mental health space. When appropriately created, computer-simulated worlds can immerse users in a digital environment that can help treat many mental health conditions. VR therapy offers a unique approach to mental health care that combines technology with therapeutic techniques. \nVR therapy involves immersive digital environments where patients can interact and experience scenarios relevant to their conditions. The aim is to expose patients to controlled scenarios that elicit emotional and psychological responses. Such scenarios give people the opportunity to gradually confront and overcome their fear or anxiety in a controlled and safe environment. Some people with anxiety and phobias perceive specific safe scenarios and situations as horrid. When such patients recognize their feelings and thoughts, they can repeatedly train them in these dreadful situations to reduce the fear they feel in these scenarios. \nVirtual reality therapy has promise as a treatment for many different mental health issues, despite not yet being quite mainstream. It may be a way to offer therapy to people who might not otherwise try it. Currently, it does not replace standard treatments for mental health conditions. Instead, it is used as an additional treatment.\nAddressing conditions and disorders using Virtual Reality Therapy\nPost-traumatic stress disorder (PTSD) is a condition that can arise from witnessing or being involved in a traumatic event. Though effective, traditional treatment approaches like cognitive-behavioral therapy (CBT) can be difficult and challenging for patients to undergo because they involve revisiting traumatic memories, which can cause emotional distress. VR therapy offers a unique approach to addressing PTSD through a method known as virtual reality exposure therapy (VRET).\nVRET involves recreating a virtual environment that resembles the traumatic event, allowing patients to confront their fears in a controlled and safe setting, allowing patients to process their trauma and gradually reduce their emotional responses. The immersive nature of VR can help patients feel more engaged.\nAnxiety disorders often involve excessive worry and fear. VR therapy can simulate various social scenarios for individuals with social anxiety. Patients can practice interactions in a virtual setting where they can gradually build confidence and coping skills without the immediate pressure of real-life encounters. The virtual environment acts as a safe space for patients to experiment with different strategies for managing anxiety. People can gradually desensitize themselves to anxiety-inducing situations in such safe virtual environments. \nSimilarly, Phobias or intense, irrational fears of specific objects or situations can addressed with VR therapy because they allow patients to confront their fears in a virtual setting that can mimic the real-world scenarios that cause distress. A person can practice various social and emotional skills using VR therapy.\nPatients with depression often struggle with low motivation and a sense of detachment from their surroundings. VRT can counteract this by offering interactive virtual environments that stimulate the senses and encourage participation. By providing virtual scenarios where patients can practice and enjoy activities they may have previously abandoned, VRT helps them build motivation and break the cycle of inactivity common in depression. So, VRT can be quite a valuable tool in the fight against depression.\nBenefits of Virtual Reality Therapy\nControlled and Customizable Environment: One of the primary advantages of VRT is the ability to create and control the therapeutic environment. Therapists can adjust the virtual setting based on the patient's reactions, providing a personalized and adaptable treatment experience.\nEnhanced Engagement: The immersive nature of VR often leads to higher patient engagement than traditional therapy. The novelty of the technology and the interactive aspects of VR can make therapeutic exercises more engaging and enjoyable, improving treatment adherence.\nSafe Exposure: VR therapy allows patients to face their fears or revisit traumatic events in a controlled and safe way, reducing the risk of overwhelming patients and helping them build resilience gradually.\nAccessibility: VR therapy can be accessed remotely, making it a valuable option for patients with difficulty attending in-person sessions. VR can also make treatment more accessible as individuals could engage in sessions from the comfort of their homes.\nChallenges associated with Virtual Reality Therapy\nDespite its potential and benefits, integrating Virtual Reality into mental health practices involves some challenges. The technology can be expensive, making high-quality VR equipment a significant investment for healthcare providers. Not all healthcare providers will have access to the required VR equipment. It's essential for therapists to carefully assess the suitability of VR therapy for each patient and address any potential issues that may arise.\nNot all VR systems are the same. Variations in hardware quality and software capabilities can affect the effectiveness of the therapy. \nAlso, not all patients may be comfortable with or willing to use VR technology. Some individuals may have concerns about the technology itself. Some patients may also find it challenging to adapt to the VR experience. VR systems can cause discomfort or have adverse effects for certain patients. Motion sickness brought on by virtual reality, commonly called simulator sickness, is a prevalent problem resulting in symptoms like headaches, nausea, and dizziness. For those sensitive to motion or immersive experiences, in particular, this discomfort may pose a serious obstacle to the effectiveness of virtual reality technology.\nFuture of Virtual Reality Therapy\nWhile the research supporting VRT is promising, it is still a relatively new field, and there is a need for more extensive and long-term studies to understand its efficacy and potential limitations fully. Virtual reality technology will likely find more uses in mental health treatment as it develops and evolves. In the future, VRT may become a more integral part of mental health treatment. VR hardware and software advances may lead to even more immersive and realistic therapeutic environments. In the future, it is also possible that VR will be integrated with biofeedback or neurofeedback. Such integration could enhance its effectiveness. VR therapy has the potential to provide a more comprehensive approach to mental health treatment.\nConclusion\nVirtual Reality Therapy represents a promising advancement in the treatment of PTSD, anxiety, and phobias. As technology continues to advance and research in the field of VRT expands, it is likely that the challenges currently associated with VRT will be mitigated, leading to more widespread adoption and integration of VR into mental health treatment. By utilizing the power of immersive technology, VR therapy offers a novel and effective way to address these challenging conditions."
  },
  {
    "title": "STARTUP OF THE MONTH: INSPIRE AI",
    "link": "https://edciitdelhi.substack.com/p/startup-of-the-month-inspire-ai",
    "published": "Mon, 23 Sep 2024 16:56:54 GMT",
    "content": "In December 2023, IITD students Krishant Sethia and Vinayak Agarwal had a spark of inspiration; a simple but powerful idea: what if there was an app that didn't just help people write content, but made it effortless to post consistently, day after day? The founders, driven by the zeal to build something new, something original. To them, tech was the most fascinating field and LLMs, which were the hot topic of this time, seemed to them as the perfect opportunity to materialize their passion. By February 2024, that idea became reality with the formation of InspireAI. Unlike other tools that focus solely on content creation, InspireAI is all about forming the habit of posting, making it second nature by removing the usual hassles that slow people down. It’s like having a personal assistant who ensures your thoughts and ideas are always out there for the world to see.\nInspireAI had its alpha release in March 2024 and today, it has garnered around 250 users eager to boost their online presence, especially on LinkedIn. But here’s the kicker: isn’t just about churning out content; it’s smart. With powerful AI-driven analytics, it helps users to crack the LinkedIn code, fine-tuning posts to hit the sweet spot between quality and quantity. It’s not just about being heard—it’s about being heard by the right people, at the right time, in the right way. And that’s what makes InspireAI more than just another app; it’s a game-changer for anyone serious about making their mark online.\nAlright, here’s a fun challenge for you: Two articles below—one's crafted by InspireAI, and the other by a human. Can you spot which one’s AI-made? Get your detective hats on and let the hunt begin! Happy sleuthing!\nThe Olympic Gamble: How Hosting the Games can Make or Break Cities \nArticle 1:\nEver wondered which cities get the gold when it comes to hosting the Olympics?\nThe hosting of the Olympic Games is a prestigious endeavor that can bring a myriad of benefits to the host city and country. But, it is also a huge financial wager, with cities like Montreal and Rio de Janeiro still grappling with crippling debts and underutilized infrastructure post Games.\nUndoubtedly the winners of these games are cities like Los Angeles and Paris that have navigated the financial challenges of hosting the Olympics more successfully. Los Angeles even made a rare operating surplus. \nOften cities with already well-developed facilities like Paris, London, and Tokyo can leverage their existing assets to host successful Games. Moreover, these cities are known for their tourist appeal and can benefit from an influx of visitors during the Games. Their robust economies are more likely to manage the financial risks associated with organizing such a massive event. For example, Paris with its wealthy treasury, managed to clean the entire River Seine, a herculean task which could not have been done for years.\nHowever, not every city should consider hosting the Olympics. Countries with limited resources, unstable economies, or a lack of infrastructure might find the financial burden too heavy to bear. Recently, the urge to host the games in Africa has been at its peak, since from its inauguration, no Olympic Games have been held in the continent. The challenge here is obvious, lack of finances. Even the most influential cities like Durban have expressed their financial inability to host the Commonwealth Games, a sporting event much smaller than the Olympics in sheer scale.\nIn conclusion, while the Olympics can bring prestige and economic benefits, it's not a decision to be taken lightly. Cities with strong tourism industries, existing infrastructure, and stable economies are more likely to reap the rewards. But, cities facing financial challenges or other obstacles should carefully weigh the potential risks before committing to hosting the Olympics.\nSo, the next time you watch the Olympics, remember the city hosting the Games is performing a balancing act of prestige and practicality. \nArticle 2:\nOne can say that the absolute majesty of the Games of the Olympiad, better known as the Olympic Games lies in the flame of the ever lit Olympic Torch. After all, with the Games changing their venues every four years, the flame is the only constant in the multiverse of changes. Literally, the brightness of the torch is not bound by the hospitality of its hosts, figuratively though, the vigor of the Olympic Flame is dimmer in some countries than in others. Some like Los Angeles, have meticulously mastered the skills of hosting the Games, others like Rio De Janeiro have been burdened by the exorbitantly high costs. It seems as if the statuesque flame is kinder to some than to others. Why do some countries excel in hosting the Games, while the others are marred with mediocrity?\nUnderdeveloped regions are often quick to consider the Olympics as a golden ticket to kickstart infrastructural development. However their economies, often in their budding stages, are not equipped to handle the herculean costs to host the mammoth Olympic Games. Moreover, the task of hosting the grandness of the Games will only suction out the money that could have either been used in essential spheres of healthcare and education, which could have genuinely affected the majority populace. \nPeculiarity arises when relatively smaller nations bid to host the Games. Frenzied by the notion to gain international recognition, they become covetous about the magnificent tourism that the Games bring in and picturesque spectacle they put forward. In this process, they are often overwhelmed by the huge influx of visitors into their lands. These countries, often having smaller populations are unable to handle this colossal strain.\nThe wager of hoisting the Olympic Games is thus a greater trade off between prestige and practicality. While some cities still reminisce about the Halcyon days of hosting the Olympic, some are left to question their choices and bear the stigma of underutilized facilities. We can rightfully say that hosting the Games is a gamble between Pride and Prejudice. The nationalistic pride that emanates from the thought of hosting the biggest sporting festival and the draconian prejudice that may follow afterwards if your risk was not worth it. After all, in the words of Edmund Burke, It is a grand mistake to suppose that the loudest complainers for the public to be the most anxious for its welfare. Pride and prejudice have too often led nations to grand, but ill-advised decisions."
  },
  {
    "title": "Innovative Space-tech Startups and Why You Should Care",
    "link": "https://edciitdelhi.substack.com/p/innovative-space-tech-startups-and",
    "published": "Sun, 01 Sep 2024 15:04:08 GMT",
    "content": "Almost a decade after watching Matt Damon trying to survive Mars on screen,  people still think investing in space is equivalent to throwing all your money away. They are not to be blamed for this opinion, after all, it is very daunting to take your savings and put them in the middle of nowhere,quite literally . What’s the first thing that comes to mind when you think about space tech? Space missions, satellites, mining, Elon Musk. What can you really try to achieve in space, except sitting in a box while it goes in circles about a massive rock? Turns out, there’s much more you can try your hand at. This article will not tell you about the next NASA mission, or a new launch propulsion system. It will take you through new (seemingly strange) space-tech startups trying to create a marketplace there, just like the one on Earth. \nSpace farming and Biotech\nSpace farming is not a foreign concept to us. When you are actively trying to make a home somewhere, it is not unnatural to look for food options. In space, owing to the lack of convenience stores, we would have to grow our own food. However, there is another incentive to do this : innovations in space farming can lead to developments in agriculture here on Earth. Global food shortages and environmental challenges could be faced with the ideas developed in space agriculture. \nSpace-based biotech research, like growing organs and tissues in zero gravity, could lead to medical breakthroughs. Microgravity environments allow scientists to study biological processes in new ways, which could possibly lead to progress in regenerative medicine here on Earth. \nFor long-term space missions to Mars or other planets, being able to grow food in space is not just a luxury, it’s a necessity. Developing this technology lays the groundwork for a potential future colonisation of space (with vibrant grocery stores).\nAleph Farms\n, which was originally focussed on lab-grown meat on Earth, is expanding its vision to include cultivating meat in space. By using animal cells, they aim to grow beef steaks in a microgravity environment, mainly to provide for astronauts.\nRedwire Space \nis one of the pioneers of space-based bioprinting technology. Redwire's BioFabrication Facility on the International Space Station (ISS) is being used to research how to create human tissues and organs in microgravity\nSpace Tango\n, already a leader in microgravity research, develops automated platforms that allow for biological experiments in space. Their work includes growing plants and studying cell behaviour, with applications ranging from improving agriculture on Earth to supporting long-term space missions.\nSpace debris recycling\nDo you ever think about all that space junk floating around, left to nobody? Turns out there are people who have started to do something about it. There are startups which try to develop methods to recycle and repurpose this space debris into something useful. Defunct satellites, spent rocket stages and fragments from collisions are a growing threat to astronauts and future space missions. Instead of letting valuable materials float around uselessly in space and pose such threats, these startups can reclaim them for future use. This space is undergoing major growth, and is a huge step towards sustainability.\nCislunar Industries \nis working on building space-based foundries to process and recycle space debris. By melting down old satellites and other space junk, they aim to create raw materials for manufacturing new spacecraft components in orbit, reducing the need for costly launches from Earth.\nAstroscale\n, a global leader in space debris removal,is developing technology to capture and deorbit defunct satellites. Their ELSA-d (End-of-Life Services by Astroscale-demonstration) mission is designed to showcase the ability to safely remove space debris from orbit, making space safer and more explorable.\nNanoracks\n, known for its Outpost program, aims to repurpose spent rocket stages and old spacecraft into usable habitats or storage depots in orbit. The concept behind the Outpost program is to create efficient use of resources already present in space, rather than launching entirely new materials from Earth.\nSpace Fashion and Lifestyle\nIntergalactical H&M sales? Sign me up! As more people, including non-professional astronauts, begin to travel to space, there’s a need for clothing and gear that provide comfort and safety in microgravity environments. Startups focussing on space fashion are developing next-generation spacesuits and garments that are not only functional, but also stylish and wearable. \nInnovations in materials used for space fashion—like lightweight, breathable, and durable fabrics—can have applications on Earth. High-performance clothing designed for astronauts could benefit athletes, divers and maybe even military personnel. \nSpace fashion signals a cultural shift where space travel is becoming a part of mainstream society. By making space exploration more relatable and fashionable, people start to become more comfortable with the idea of space exploration for non-astronauts.\nFinal Frontier Design\n specialises in next-generation space suits. It creates lightweight, flexible, and functional suits for astronauts and space tourists alike. \nGravity Industries\n is famous for its development of personal jet suits, which provide users with a unique flight experience. They are exploring how these jet suits could be adapted for use in low-gravity environments,  offering new ways to move around celestial bodies.\nSpace Burial Services\nYes, you read that right. This is probably the most bizarre one on the list, but it’s one of the fastest growing industries related to space. Maybe you’ve heard of people naming stars after themselves or trying to buy land on Mars. Similarly, some people are extremely connected to the idea of their ashes being scattered in space, far far away from the Earth. It has been described as a  desire to be part of something larger than life itself and to explore the unknown even after death. Space burial services offer a unique way to honour loved ones, giving families a sense of closure and a connection to the cosmos. \nCelestis\n is one of the pioneers in space burial services, offering memorial spaceflights that send small portions of cremated remains into orbit or to the Moon.\nElysium Space\n is a startup that specialises in space memorial services, including launching ashes into space and allowing them to orbit Earth before re-entering the atmosphere in a final blaze.\nConclusion\nThis list might seem too trivial, too futuristic or too ambitious to an average person. The truth of the matter is that the newer your idea is, the quicker you set your plan in motion, the more successful you are likely to be. Sure, nobody in your vicinity is thinking about what they’d wear in space, or can even fathom going to space. However, considering the pace at which technology advances and the number of people actively involved in space research and missions – one thing is very clear. Not very far into the future, space tourism or colonisation will no longer seem like a distant dream, and the startup opportunities in this field are innovative and endless."
  },
  {
    "title": "Brain Breakthroughs: How Brain-Computer Interfaces Are Redefining Human-Tech Interaction",
    "link": "https://edciitdelhi.substack.com/p/brain-breakthroughs-how-brain-computer",
    "published": "Sun, 25 Aug 2024 15:42:54 GMT",
    "content": "In the realm of Human-Computer Interaction which aims to improve how people communicate with and utilize technology, few advancements are as groundbreaking as brain-computer interfaces or BCIs. BCIs promise to transform how we interact with devices and enhance human cognition.\nWhat exactly is the field of HCI, and what does it focus on?\nHuman-Computer Interaction, or HCI, is a multidisciplinary field that explores and researches the design and use of computer technology. This field primarily focuses on the interfaces between users and computers. Hardware and software that facilitate seamless communication between users and computers come under HCI. At its core, HCI focuses on creating interfaces that are intuitive, efficient, accessible, and easy to understand.\nOne of the fundamental goals of HCI is to improve usability by studying how users interact with technology. Systems that are functional, user-friendly, and easy to learn are much easier to use. HCI also attempts to address accessibility and inclusivity by ensuring that technology can be used by people and users with a wide range of abilities and disabilities.\nWhat are Brain-computer interfaces (BCIs)?\nBrain-computer interfaces (BCIs) are technologies that establish a direct communication pathway or link between the brain and external devices, like computer systems. Such an interface translates brain signals into commands that can control computers, prosthetics, or other devices. BCIs allow for more intuitive interactions with technology. BCIs are a subset of HCI. While HCI broadly encompasses different forms of interaction between humans and computers, BCIs specifically focus on establishing direct communication pathways and links between the human brain and computer systems.\nThe classification of BCIs\nBCIs can be classified into different types on the basis of how invasive they are. \nInvasive: Invasive BCIs require surgery to be implanted. Such BCIs are implanted under the scalp to communicate brain signals. More accurate readings are received in such systems, but such systems have some disadvantages as well. After the surgery, scar tissues may be formed, weakening the signals. Further, the human body may not accept the electrodes, leading to medical complications. \nSemi-invasive: Such BCIs are implanted inside the skull but rest outside the brain. They produce signals having a better resolution than non-invasive BCIs. Since semi-invasive BCIs are present outside the brain, they have a lower risk of forming scar tissue in the brain.\nNon-invasive: Non-invasive BCIs encompass all the technologies that allow for brain-to-computer stimulation without requiring penetration into the skull. Most non-invasive BCIs rely on electrodes strategically placed onto certain areas of the scalp to record brain activity.\nPicture depicting non-invasive BCI where electrodes are strategically placed on the scalp instead of penetrating the skull\nPotential applications of BCIs\nThe potential applications of BCIs are vast, ranging from medical rehabilitation and assistive technology to enhanced cognitive abilities. The possible applications are extensive and transformative.\nMedical Rehabilitation: BCIs could revolutionize the treatment of neurological disorders. For individuals with conditions such as Parkinson’s disease, epilepsy, or spinal cord injuries, Neuralink’s technology could offer new ways to manage symptoms or restore lost functions.\nEnhanced Cognitive Abilities: BCIs can enhance cognitive functions. By directly interfacing with the brain, it might be possible to improve memory, learning, and problem-solving capabilities. Such enhancements to the capabilities of an individual have profound implications for education, personal development, and productivity.\nVirtual and Augmented Reality: BCIs can revolutionize our experiences of virtual and augmented reality. Direct brain interfaces can create more immersive and interactive experiences by allowing users to perceive digital elements as seamlessly integrated into their physical surroundings and have control using just their thoughts.\nEthical and societal concerns related to BCIs\nThe development of such technologies raises several ethical and societal concerns and considerations. Although such technologies offer several advantages to humans, a future where these technologies become much more common also has some downsides.\nPrivacy: Direct access to brain activity introduces and raises concerns about the privacy of individuals' thoughts and mental states. Ensuring that neural data is protected from unauthorized access and misuse is a significant challenge but a crucial one that must be overcome.\nSecurity: The hacking of such devices could have disastrous consequences, like, for example, the manipulation of brain signals. BCIs could potentially influence or control mental processes. Thus, security challenges are present in the domain of BCIs. \nLong-term effects: The long-term impact of BCIs and brain implants is yet to be fully understood. Such brain implants may affect cognitive function, mental health, and overall well-being.\nConsent: A critical consideration to be kept in mind is that, just like any other medical or technological intervention, the informed consent of individuals is essential. Individuals must understand the risks, benefits, and limitations of BCIs before deciding to proceed with the implementation and use of such technologies. \nSeveral features offered by BCIs are present in several episodes of the British anthology TV series Black Mirror, which covers advanced technology's dark and dystopian implications, serving as a powerful narrative device to probe complex themes about human consciousness, privacy, and societal impacts.\nHow is Elon Musk’s Neuralink related to BCIs?\nOne of the most talked about developments in this domain is Neuralink, an American neurotechnology company founded by Elon Musk in 2016. The company, currently at the forefront of brain-computer interface technology, has garnered significant attention for its ambitious goal of achieving “symbiosis” between the human brain and artificial intelligence. \nPictures showing the Neuralink brain implant\nOn the Lex Fridman podcast, Musk recently revealed that the company has successfully implanted its device in a second patient. This device is designed to allow paralyzed patients to use digital devices by thinking alone, Elon Musk. The device has allowed the first patient to play video games, browse the internet, post on social media and move a cursor on a laptop. Controlling a computer cursor with thoughts alone could soon become common. \nNoland Arbaugh, who received the implant in January, also spoke on the Lex Fridman podcast about how the implant changed his life. Before receiving the implant, he used a computer by employing a stick in his mouth to tap the screen of a tablet device. Now, he can merely think about what he wants to happen on the computer screen, and the device makes it happen. The device has helped him become more independent and less reliant on others. \nConclusion\nThe advent of brain-computer interfaces (BCIs) marks a shift in how we interact with technology. BCIs promise to revolutionize fields ranging from medicine to cognitive enhancement. However, as we advance further into this realm, addressing the accompanying ethical and societal challenges is imperative. Balancing the promises of BCIs with these ethical considerations with care and foresight is crucial for integrating this transformative technology into society in a way that respects individual rights and promotes overall well-being."
  },
  {
    "title": "ECONOMIC DIPLOMACY: THE FINE BALANCE OF TRADE POLICIES AND GEOPOLITICS",
    "link": "https://edciitdelhi.substack.com/p/economic-diplomacy-the-fine-balance",
    "published": "Mon, 12 Aug 2024 16:02:30 GMT",
    "content": "In the complex world of changing allegiances, economic diplomacy plays a vital role in traversing the ways through trade policies and geo-political dynamics. Many experts believe that wealth is undoubtedly the strongest armour of the arsenal that guards the majesty of a country. It is the bedrock for fostering intercontinental relationships. One must not be naive to label economic diplomacy as mere transactions since it extends way beyond that. It is a strategic art of resolving conflicts and upholding national interests simultaneously.\nGeopolitical History: Shaping Economic Policies Through the Ages\nThroughout history, the intricate dance between geopolitics and economic policy has orchestrated the rise and fall of empires, the realignment of global powers, and the transformation of economies. Beginning from the Medieval Ages, Europe emerged as a center of geopolitical dynamics. The feudal system, driven by the concept of land ownership and production, became the center stage for wealth and power. The Crusades, although fueled by religious sentiments, had a significant economic impact. They opened up trade routes and fostered economic exchange between Europe and the Middle East, thereby shaping the global economic landscape.\nThe Cold War era epitomized this interplay, with the United States and the Soviet Union championing diametrically opposed economic systems—capitalism and socialism—that reverberated through global trade networks and international alliances. History is also witness to some of the most groundbreaking economic treaties, like the Shanghai Communique, signed between the US and China in 1972, which led to the normalization of the global sphere. There are endless instances where two countries have ended their adversarial pasts and descended to mutual cooperation. This is because economic discussions often involve calculated talks, usually free from jingoism or extremism. Hence, it forms an excellent forum for renewed discussions.\nThe Crusades of the 1100s were the premier geopolitical event with an economic impact.\nContemporary Trade Dynamics: The New Geopolitical Battlefield\nOften, economics has been hailed as a multilateral maneuver. When different countries or regions come together to form economic pacts, such as the North American Free Trade Agreement (NAFTA) or the Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP), they strengthen their positions around the globe. The formation of the EU and BRICS countries has been driven by financial gains. Now, they have been transformed into political alliances in which the strengths of others have strengthened each of the individual member states. Through cooperation, countries seem to have gained a certain economic ‘momentum’. This year’s EU General Elections witnessed the increasing power of right-wing parties. Thus, now we can expect Europe to be propelled towards more capitalistic ideals of free trade and lower immigration. This will also affect the intricate patchwork of Europe’s relations with its more left leaning or socialist allies. \nPost-World War II, institutions like the IMF and World Bank were created to stabilize economies and foster international cooperation, illustrating the relentless influence of geopolitical forces on economic strategies. Though, critics argue that the IMF unjustly favours the wealthier nations and its harsh loan conditionality has been the cause of social unrest in many vulnerable countries. This shows how the concentration of money in a few hands affects the lives of a much larger populace.\nThe graph depicts that majority of IMF loans are offered to economically and socially vulnerable countries\nEconomic Foundations: The Primacy of Trade Over Terrain\nA case study very rightly reveals the importance of leveraging this economic clout. During the cold war two neighboring east European countries, Czechia and Slovakia followed two different paths of bilateral alliances. While Czechia openly aligned with the capitalist West, Slovakia was initially hesitant to do so. To this day, Czechia has an economy almost 30% wealthier than that of Slovakia. Although this cannot be totally attributed to Slovakia’s initial reluctance, some might believe that this must have had a substantial impact. It is interesting to note how economics exceeds geography in these aspects. Hence in this intertwined world, navigating through the economic chessboard becomes the most important skill of a global statesman. \nEconomic Warfare: Trade Tensions and Sanctions in a Global Landscape\nIn an age of global interconnectedness, the impact of economic decisions ripples far beyond national borders. Trade wars, tariffs, and sanctions have emerged as tools of geopolitical strategy, shaping relationships between nations. Wealthier and influential countries have always maneuvered these on political, economic and military fronts. The US is undoubtedly a country which has a long standing history of sanctions. While some of the sanctions are politically motivated, like the US sanctions on Russia after the annexation of Crimea in 2014, some are also imposed in order to polish the lustre of the US economic crown. A vivid example of this has to be the US-China Trade War of 2018, when both countries retaliated with tariffs on one another, thus escalating tensions and disrupting supply chains worldwide. Some sanctions are also imposed to showcase military power, like when the US imposed sanctions on India after the latter conducted nuclear tests in Pokhran in 1998. \nTug of War: Globalization vs. Nationalism\nThe tension between globalization and nationalism has emerged as a defining feature of contemporary geopolitics. Globalization, with its promise of interconnectedness and shared prosperity, often clashes with nationalist sentiments that prioritize sovereignty and local identity. While the support for globalization supersedes the political spectrum, some on the conservative side argue about the social impact of increasing globalism, particularly in the case of immigration. The Brexit referendum epitomizes this struggle; the British electorate under its then newly elected and popular Conservative Tory Government, fueled by a desire to reclaim control over borders and trade, voted to leave the European Union, signaling a retreat from supranational governance. This pivotal moment highlighted the allure of national autonomy in an era of perceived economic uncertainty. As nations grapple with these competing forces, the future of international cooperation hangs in the balance.\nThe Modern Nuances of Geopolitics: Tech, Climate and Energy Politics\nIn recent years, geopolitics has evolved into an entirely new concept. It is no longer centered around isolated trade. Rather, it has grown subtle undertones of sustainability and modernism. As we witness the tech revolution, we must also keep in mind how global powers have used it in a form of warfare. This new ‘tech warfare’ has opened an entirely new front of global competitiveness. Similarly, the issue of sustainability has shaped a newer form of trade. As nations confront the existential threat of climate change, they are compelled to reimagine their energy policies and invest in sustainable technologies. This transition has sparked a race for green innovation, where countries vie for leadership in renewable energy sectors and eco-friendly technologies.\nAnd how can we forget about oil. This black gold has literally and figuratively fuelled global politics and trade. The Gulf countries in general, are the biggest winners of the oil game. Saudi Arabia and the UAE are some countries which have harnessed their power and have tackled even the most powerful countries like the US while taking an independent political stance which is often not in the former’s favour. However, this has also led to conflicts in the area. The US-Iran trade sanction is a good example of this. This shows how the bounties of geography can be harnessed to pivot global economics. \nThe OPEC dominating Crude Oil Production \nA Newer Geopolitical Outlook: Road to a Multipolar World\nGone are the days when one country had the monopoly over global politics. As the paradigm shift fosters a complex web of alliances and rivalries, as emerging powers such as China, India, and Brazil assert their influence on the global stage which was earlier dominated by old powers like the US, Russia and Europe, we will progress towards a pluralistic world. In this multipolar world, even the smallest of the nations provide the greatest diplomatic standpoints. A visionary leader is thus, a person who can bridge gaps, diffuse tensions and chart a path to progress and peace.\nIn conclusion, economic diplomacy is an indispensable tool to navigate the intricate web of global relations and nationalistic ideals of progress. After all, when development is fueled by green bags, one must keep a good check on its statistics and dynamics.  \nLeave a comment\nShare"
  },
  {
    "title": "MONACO: PLAYGROUND OF THE ELITE",
    "link": "https://edciitdelhi.substack.com/p/monaco-playground-of-the-elite",
    "published": "Mon, 05 Aug 2024 14:03:44 GMT",
    "content": "The Monaco Grand Prix is more than just a race; it is a symbol of luxury and glamour. Due to its inception in 1929, this race is among the oldest and most esteemed in Formula One racing. The utterance of the name ‘Monaco’ reminds people of affluence and high society. In recent times, Monaco and Formula Racing have become increasingly popular due to devoted fanbases and the powerful influence of social media. Charles Leclerc’s recent win at the Monaco Grand Prix was truly one for the history books. Born and raised in Monaco, his success story cemented Monaco’s status in the world of motorsport. These celebrity drivers continue to amass huge fanbases, attracting millions of people to tune into formula racing. Monaco is known to be the wealthiest playground in Formula 1, and there is more where that comes from. Despite its small geography, Monaco opens up a wide array of business and investment opportunities for the world. \nCharles Leclerc with his Monaco GP trophy (2024)\nThe Allure of Monaco\nThe Monaco Royal Family                                       \nAlong with its luxurious amenities, Monaco boasts of a rich heritage. With celebrated events like the Monaco Yacht Show and the Grand Prix, it attracts tourists all year round. Monaco was established as a sovereign city-state in 1297. Like Britain, it is a constitutional monarchy, ruled by the Monaco Royal Family. Their intriguing history and the existence of royalty in this day and age add to the charm of this place. It is home to many renowned landmarks, such as the Monte Carlo Casino, the Prince's Palace, and the Oceanographic Museum. Monaco has a thriving tourism industry, and by the looks of it, it will only grow multifold in the coming years. \nEconomic Impact of the Monaco Grand Prix\nEnthusiastic fans at the Monaco Grand Prix (2024)                          \nIt is safe to say that the Monaco Grand Prix provides a significant boost to the local economy. During the race weekend, Monaco welcomes many visitors, including high-profile celebrities, royalty, and business magnates. On social media, this race breaks records of engagement on apps like X and Instagram, with loyal fans rushing to share their favourites and celebrate the rankings of the race. Numerous influencers create content in the form of reels and live videos to display the glamour of this event and garner views, adding to its popularity. Hotels and restaurants experience a sudden surge in business, with occupancy rates reaching nearly 100%. The economic impact extends to various sectors, including hospitality, retail, and services, contributing millions of euros to its economy. Due to its immense popularity worldwide and the fanbases of its celebrity drivers, the race also generates revenue through sponsorship deals, media rights, and ticket sales, making it a defining financial event for Monaco. \nReal Estate and Property Market\nMonaco’s real estate market is one of the most expensive globally. The high demand for property, paired with limited space, makes sure that real estate prices remain incredibly high and the market stays active throughout the year. This market attracts high-net-worth individuals (HNWIs) looking for secure investments and luxurious lifestyles. Real estate developers in Monaco continue to attract the elite by pushing the boundaries of comfort, and creating more modern residences, attracting wealth from all corners of the world.\nOpportunities for Investors and Entrepreneurs\nMonaco's location is not only advantageous for traditional business sectors but also for emerging startups. Monaco is well-connected to the entire European market, as well as Africa and the Middle East, owing to which international trade flourishes here. For tech startups, this connectivity means quicker market entry, more accessible partnerships, faster growth and more efficient supply chain management. Monaco offers many investment opportunities in sectors such as real estate, technology, and sustainable development. Monaco's government also supports entrepreneurial ventures through initiatives like the MonacoTech incubator/accelerator launched in 2017, providing startups with the resources and networks needed to thrive in a global marketplace. It was implemented by the Prince’s Government to encourage economic activity and entrepreneurship. Commendably, it has already attracted more than 300 applications from around 30 countries and supported several projects across a wide variety of fields (cleantech, fintech, medtech, smart city, yachting, and the space industry).\nThriving Financial Sector\nMonaco has established itself as a prime center for private banking, wealth management, and financial services. It is home to several private banks and financial institutions. These institutions offer customised solutions to meet the extensive needs of wealthy clients, including estate planning, asset management, and tax advisory services. This comes as no surprise, as it houses extremely well-off residents and high-profile investors. While Monaco offers friendly tax conditions, it also maintains strict financial regulations to ensure fairplay and avoid scandals like money laundering. It follows international standards set by organizations like the Financial Action Task Force (FATF) and is renowned for being a safe and reliable center for financial management. \nMonaco’s Tax Benefits\nOne of Monaco’s most significant pros is its favourable tax regime. It does not impose income tax on its residents, making it an attractive option for HNWIs and entrepreneurs who want to minimise the burden of taxes. This policy has attracted many individuals and businesses to set up their base in Monaco. Also, it offers optimum business conditions, with low corporate taxes and exemptions on wealth, capital gains, and inheritance taxes. There is a corporate tax that is imposed, but it is significantly lesser than those of other European nations. Companies with more than 25% of their revenue generated outside Monaco are required to pay a 33.33% tax rate. However, various incentives are provided that can significantly reduce this burden too. \nApproach to Sustainability\n                                        Largest solar power station in Monaco\nThough its luxurious appeal can make it surprising, Monaco is actively committed to sustainability. The government has implemented various initiatives to reduce its carbon footprint and promote environmental responsibility. Monaco is investing heavily in renewable energy sources, such as solar and wind power, to reduce its dependency on non-renewable resources. The government has set big targets to reduce greenhouse gas emissions, aiming to become carbon neutral by 2050. This includes means such as installing solar panels on buildings and providing incentives for businesses to be more conscious and adopt environmentally friendly means to carry out their activities. However, Monaco’s efforts towards sustainability are not only about environmental conservation but also about economic and social benefits. By leading in green initiatives, it attracts eco-conscious businesses and investors, fostering a market for sustainable products and services.\nConclusion\nBeyond its image as a playground for the rich, Monaco is a thriving hub for business and finance, attracting entrepreneurs and financiers from around the world. Its financial sector, strategic connectivity, and commitment to sustainability make Monaco an attractive environment for those who want a high-quality lifestyle and a good business climate. Monaco continues to gain traction in popular media for its picturesque views and boastworthy event lineups. The Monaco Grand Prix, in particular, further amplifies this unique blend of fame, luxury and opportunity, an event that truly defines the riches of Monaco. \nSubscribe\nShare\nLeave a comment"
  },
  {
    "title": "Cheers to Deception? How Liquor Brands Navigate India's Advertising Ban",
    "link": "https://edciitdelhi.substack.com/p/cheers-to-deception-how-liquor-brands",
    "published": "Fri, 02 Aug 2024 15:58:25 GMT",
    "content": "Consider catchy and creative advertisements for a product you cannot easily purchase. Although it seems like a way to waste money, numerous brands employ this strategy to promote products restricted from advertising under government regulations, such as alcohol, by advertising another product produced by the same company. This ‘another product’ is often one that cannot be bought.\nThrough the Cable Television Networks Act of 1995, the Government of India banned any ads that directly or indirectly promoted the sale or consumption of intoxicants. Surrogate advertising has allowed the liquor industry to become a prominent player in the advertisement industry through catchy ads promoting products like cassettes, CDs, and soda. Advertising alcoholic beverages is banned in India, and so surrogate advertising is used to exploit legal loopholes to promote them.\nThe different tactics of surrogate advertising\nBrand extensions: This is the most apparent tactic of surrogate advertising is brand extension, where alcoholic brands advertise non-alcoholic versions of their products, like mineral water, soda, or even products that are not beverages, that share the same brand name in order to circumvent advertising restrictions.\nSponsoring: Liquor brands sponsor events, concerts, sports tournaments, or cultural festivals that are associated with their brand identity or culture. By associating themselves with the unique qualities of their brand without explicitly promoting alcohol, they can foster a positive perception of their brand. Liquor brands also sponsor some events where alcohol consumption is prevalent, thus indirectly reinforcing their association with leisure and celebration and maintaining a presence in the minds of their target audience.\nDigital and Social Media Strategies: Alcohol brands utilize social media channels, digital content, and influencer partnerships to engage with consumers while adhering to regulatory constraints. Brands reach a wider audience and maintain relevance this way.\nProduct placement: The strategic integration of alcoholic beverages into entertainment content allows brands to associate themselves with desirable social experiences and cultural norms, which can lead to subconscious associations of alcoholic drinks with desirable lifestyle attributes. Further, effective product placement can easily enhance brand recall and recognition or provide brand visibility of a particular beverage to many people.\nAre there any regulations for brand extensions?\nBrand extensions in the alcohol industry are regulated under the Cable Television Networks (Regulation) Act. The Advertising Standards Council of India (ASCI) has guidelines for the qualification of brand extensions. ASCI tightened these guidelines in December 2023. ASCI is a voluntary self-regulatory organization of the advertising industry in India. In the past, ASCI has banned surrogate advertising by liquor companies that violated its code. According to the amended Cable TV Network Rules’ Advertising Code, ads that violate the ASCI code cannot be permitted on TV.\nThe ASCI guidelines say that the brand extension must be genuine. The brand extension must be registered with the appropriate Government authority. \nFor a brand that has been in the market for more than two years, the sales turnover of the product or service should exceed Rs. 5 crore per annum nationally or Rs. 1 crore per annum per state where the distribution has been established. \nBrands launched but yet to complete two years should have achieved a net sales turnover of Rs. 20 lakhs per month from launch. The sales should not be to a subsidiary or sister. Instead of these, the company can also show that they have made fixed asset investments exclusive to the advertised brand extension of not less than Rs. 10 crore or show that the turnover of the brand is greater than 10% of the turnover of the same brand in the restricted category, including the sub-brands in the restricted category. Further, the scale of advertising for such an extension must be proportionate to the sales of that extension.\nConcerns regarding surrogate advertising\nAlthough such advertising may seem innocent, these ads raise significant ethical and regulatory concerns. Such ads are designed to leave the desired effect on the viewers’ minds by circumventing advertising laws. Such ads perpetuate brand recall and consumer loyalty for alcohol brands through proxy products. Surrogate advertising often highlights the brand's heritage, craftsmanship, or unique qualities through storytelling and emotional appeals. This helps to build a positive brand image without explicitly promoting alcoholic beverages. Since such advertisements attempt to capture a particular vibe or culture, they indirectly glamorize and normalize alcohol consumption among impressionable youth who may be exposed to these advertisements because capturing a culture allows brands to create a community of loyal followers who want to associate with that culture. Some brand extensions can compromise consumer safety, health, or well-being. \nSurrogate advertising also raises questions about transparency, honesty, and accountability. Studies have shown that consumers are able to identify surrogate advertising. Consumers may think that one product has been promoted under the guise of another and feel that they have been misled if clear and accurate information about the product extension has not been provided. Further, while they may understand the underlying intent, the association with premium or aspirational products can subconsciously enhance the appeal of the core alcoholic brand.\nWhy do brands engage in this practice?\nLiquor companies have their reasons for engaging in this practice. The government allows these companies to do business and taxes a considerable chunk of their profits but bans one of their best ways of increasing sales. If a product's sale is allowed, you should be able to advertise it. Surrogate advertising allows companies to maintain brand visibility and engage with consumers legally. Surrogate advertising is a strategic necessity for alcohol brands to maintain brand visibility and market share. Surrogate advertising will enable brands to engage responsibly with their target audience by promoting lifestyle choices associated with their brand, like leisure activities or social gatherings. Such strategies allow brands to stay competitive and contribute to economic growth while adhering to legal boundaries.\nConclusion\nSurrogate advertising of alcohol in India represents a complex intersection of business, regulation, and ethics. It affects public health initiatives and challenges the integrity and transparency of advertising. There is a growing call for transparency in advertising practices. Introducing more precise guidelines and stricter penalties for non-compliance may reshape how alcohol brands approach surrogate advertising. Addressing the complicated nature of surrogate advertising is essential in safeguarding public interest and promoting responsible marketing practices.\nFor investors and stakeholders, understanding these dynamics is crucial for assessing the sustainability and ethical implications of businesses operating in the alcohol industry. \nThe current system can leave consumers vulnerable to manipulation and undermine public health initiatives. Success will hinge on creating clear boundaries and enforcing them effectively, ensuring consumers are presented with genuine choices and not simply manipulated by clever marketing tactics. Ultimately, the goal is to create a transparent advertising landscape that protects consumers and promotes responsible marketing practices within the alcohol industry."
  },
  {
    "title": "THE ESG REVOLUTION: A BEGINNER'S GUIDE TO SUSTAINABLE INVESTING IN INDIA",
    "link": "https://edciitdelhi.substack.com/p/the-esg-revolution-a-beginners-guide",
    "published": "Fri, 19 Jul 2024 12:51:45 GMT",
    "content": "Imagine you're an investor, eager to grow your wealth while making a positive impact on the world. How does one go about judging the sustainability of a startup from ethical and environmentally conscious standpoint? Have you heard of ESG scores? If yes then what do they really mean? And how do investors use them to make informed investment decisions in India?\nThe Story of Sustainability\nLet's start with a story. Meet Mr. X, a young professional who wants to invest in companies that align with his values. He's concerned about climate change, social inequality, and corporate governance. Mr. X discovers that many companies in India are now disclosing their Environmental, Social, and Governance (ESG) performance. This information helps him make more informed investment decisions.\nWhat are ESG Scores?\nESG scores are like a report card for companies. They measure a company's performance on three key aspects:\nEnvironmental (E): How well does the company manage its impact on the environment? This includes factors like carbon emissions, water usage, and waste management.\nSocial (S): How does the company treat its employees, customers, and the community? This includes factors like labour practices, diversity, and community engagement.\nGovernance (G): How well is the company governed? This includes factors like board diversity, executive compensation, and transparency.\nHow are ESG Scores Calculated?\nESG scores are calculated by rating agencies like Sustainalytics, MSCI, and Crisil. These agencies analyse a company's ESG performance using a combination of publicly available data and company disclosures. The scores are usually presented on a scale of 0 to 100, with higher scores indicating better ESG performance.\nHere is a simplified guide to ESG Score Evaluation:\nData Collection: Data is gathered from company reports, industry research, and stakeholder engagement. This can sound quite like our quizzes, assignments, and vivas in college courses.\nStandardization: Normalization of the data is done to ensure consistency. Similar to the normalization done for the grading of multiple groups done by different TAs.\nESG Factor Scores: Scores are calculated for each E, S, and G factor using both quantitative metrics relevant to the industry  (say carbon emissions in a cement industry) and qualitative assessments (like expert opinion). This is comparable to giving grades for different courses.\nWeighting and Aggregation: Different industries prioritise the E, S and G aspects differently. To accommodate this, scores are combined using industry-specific weights to produce an overall ESG score (usually on a scale of 0-100). Just the same as different courses carrying different number of credits in college.\nExample:\nA company scores 80 on Environmental factors, 70 on Social factors, and 90 on Governance factors.\nThe weights are 40% for Environmental, 30% for Social, and 30% for Governance.\nThe overall ESG score would be: (0.4 x 80) + (0.3 x 70) + (0.3 x 90) = 81.5\nWhy Do ESG Scores Matter?\nESG scores matter because they help investors like Mr. X make informed decisions. Companies with high ESG scores tend to be more resilient, have lower risks, and are better positioned for long-term growth. By investing in companies with strong ESG performance, Mr. X can align his investments with his values and contribute to a more sustainable future.\nAre ESG investments more profitable?\nA research team from the NYU Stern Center for Sustainable Business, in partnership with Rockefeller Asset Management, aggregated findings from over 1,000 research papers published between 2015-2020 on the relationship between environmental, social, and corporate governance (ESG) activities and financial performance.\nBased on the research, the answer is:  Yes, the study found that:\n58% of corporate studies showed a positive relationship between ESG and financial performance.\n59% of investment studies found that ESG integration as an investment strategy performs better than conventional approaches.\nESG investing provides downside protection, especially during social or economic crises.\nSustainability initiatives drive better financial performance due to improved risk management and innovation.\nAs the investment landscape continues to evolve, it's clear that ESG is no longer a niche consideration, but a critical component of a successful investment strategy. By incorporating ESG factors into their decision-making process, investors can not only align their values with their investments, but also reap the financial rewards of a more sustainable and responsible approach.\nDo Investors Really Care About ESG Scores?\nConsidering ESG scores seems to be a utopian idea where investors prioritize environmental, social, and governance factors alongside cash flows and balance sheets. However, the reality is more complex. Do investors really care about ESG, or is it just a box to be checked, paying lip service to a growing trend? The landscape of ESG investing, particularly in India, provides a nuanced perspective on this question.\nThe Indian ESG Landscape\nAs the world's fifth-largest and fastest-growing economy, India is increasingly recognizing the importance of sustainability in investing. ESG factors are no longer just niche considerations but crucial parameters in investment decisions.\nInvestor demand for ESG factors is rising. 89% of global institutional investors consider ESG factors in their investment analysis and decisions. This is up from 84% in 2021. According to Morningstar, ESG funds in India saw a 76% growth in assets under management (AUM) in 2021.\nCorporate initiatives reflect this growing interest. Major Indian corporations, like Tata Group, Infosys, and Reliance Industries, are increasingly integrating ESG principles into their business strategies.  The Securities and Exchange Board of India (SEBI) mandates top companies to report on their ESG performance through the Business Responsibility and Sustainability Reporting (BRSR) framework, underscoring the growing significance of ESG in the Indian investment landscape.\nBusiness Responsibility and Sustainability Reporting (BRSR) Framework in India\nThe BRSR framework, introduced by SEBI, requires the top 1,000 listed companies in India (based on market capitalization) to respond to 140 questions. These are divided into 98 essential indicators (mandatory) and 42 leadership indicators (voluntary), grouped into nine core categories based on the principles of the National Guidelines for Responsible Business Conduct. These categories cover aspects such as environmental protection, human rights, integrity, employee well-being, inclusive growth, sustainable goods and services, responsible consumer engagement, stakeholder responsiveness, and other principles related to business ethics, supply chain management, and innovation.\nEach principle of wise disclosure has two components: essential indicators, which are mandatory and include data on environmental factors, social impact, and employee training, and leadership indicators, which are voluntary and aimed at companies aspiring to higher levels of social, environmental, and ethical responsibility. Starting FY25, the top 150 listed entities must undertake reasonable third-party assurance as part of the BRSR Core framework.\nStandardizing ESG Ratings: SEBI's Master Circular\nThere is currently no universal standard for ESG metrics and scoring methodologies. This means that different rating agencies and organizations may use different criteria and weights when assessing companies, leading to inconsistent results.. This diversity leads to multiple frameworks and ratings, making it hard to compare and verify ESG performance accurately. \nIn a significant move to promote transparency and consistency in ESG ratings, SEBI issued a Master Circular for ESG rating providers in 2022. This circular aims to standardize ESG ratings, ensuring comparability and reliability, and introduces a new scoring system called the Parivartan score. The Parivartan score rewards companies for progress towards ESG goals, not just their absolute ESG performance. ESG rating providers must disclose their rating methodologies, including weightage assigned to different ESG factors and criteria used to assess companies. The circular also prohibits ESG rating providers from having any conflict of interest, like recieving payemts from the company,  ensuring unbiased and independent ratings, and mandates regular audits and oversight by SEBI to ensure compliance.\nConclusion\nThe journey towards sustainable investing, guided by ESG (Environmental, Social, and Governance) principles, marks a pivotal shift in global finance, and India is no exception. For investors like Mr. X, evaluating companies based on ESG criteria isn't just about financial returns; it's about aligning investments with personal values and contributing to a more sustainable future.\nIn India, the momentum towards ESG integration is palpable. Regulatory frameworks like SEBI's Business Responsibility and Sustainability Reporting (BRSR) mandate are pushing companies to disclose their ESG practices transparently. This not only enhances corporate accountability but also empowers investors with reliable data for informed decision-making.\nDespite the growing interest in ESG, challenges persist, notably the lack of standardized metrics across rating agencies. SEBI's recent Master Circular introduces measures to standardize ESG ratings, aiming for transparency, consistency, and comparability among ESG rating providers.\nUltimately, the question of whether ESG investments are more profitable is increasingly being answered affirmatively. Research indicates that companies with strong ESG credentials tend to outperform their peers over the long term, offering investors both financial resilience and alignment with broader societal goals.\nAs ESG investing continues to evolve, its impact extends beyond financial metrics alone. It represents a paradigm shift towards sustainable capitalism, where profitability is harmonized with social and environmental responsibility. For investors like Mr. X, embracing ESG isn't just a trend—it's a pathway to realizing both personal and planetary prosperity.\nLeave a comment\nShare"
  },
  {
    "title": "Balancing Dreams and Reality: The Deferred Placement Perspective",
    "link": "https://edciitdelhi.substack.com/p/balancing-dreams-and-reality-the",
    "published": "Tue, 07 Nov 2023 13:08:34 GMT",
    "content": "No More What If? Take that entrepreneurship leap right now.\nMany of you might be wondering what this newsletter is all about. Some of you might be listening to the word \n“Deferred placements” \nfor the first time in your IIT D life. Some who might have listened might not know what it is actually about,  and the left ones may not know how to avail the benefits of deferred placements. So here we are to introduce you to the What, How, and When of \n“Deferred placements.”\nThe program allows students to postpone their final-year placements to focus on their entrepreneurial ventures. If their startup doesn't succeed within the following two years, they retain the option to return and participate in the placement process through the Training and Placement Cell at IITD. This initiative aims to reduce the perceived risk of failure and encourages students to pursue entrepreneurship with added confidence.\nIt was decided that the deferred placement policy be implemented from the academic year 2015-2016 on a trial basis. Due to the successful implementation of the policy last year and the support it received, the policy is being institutionalized from this year onwards.\nProposed structure:\n• Students who are interested in pursuing a startup venture will apply for the deferred placement in the second semester of their pre-final year, i.e. a semester before their placement semester.\n• Their start-up proposal will be critically analyzed by a selection panel of experts from within and outside IIT Delhi, which will decide whom to allot the program.\n• There would be no upper cap on the number of students who would be allowed for deferred placement.\nThe student's progress would be monitored by a selection panel or a sub-committee formed by the selection panel. If the students opting for an entrepreneurship venture cannot (or are likely to) succeed within 2 years despite strong efforts, they will be \npermitted to participate in the placement process\n.\n• Any pre-final B. Tech, Dual degree, or M. Tech student can apply, provided his degree is not extended. Obviously, preference would be given to students who have been involved in entrepreneurial activity before application.\n• The student's degree on allotment of the program must finish within one year.\nAlong with this, did you know IIT Delhi has a provision for a semester break for aspiring entrepreneurs?\n Yes, Students can opt-in for a semester break to pursue their startup under the guidance of faculty mentors and also earn 5 DPE units for the same. \nDPE units, which stand for Design/Practical Experience units, are a mandatory NGU (Non-Graded Unit) requirement for Graduation. Students have to earn a  minimum of 3 DPE units and can earn up to 5 DPE units out of a total of 11 NGU required for completion of their degrees.\nStudents who wish to pursue their startup taking a semester break must work under the guidance of a faculty mentor from the institute. They need to plan and submit a project proposal with consultation from their faculty mentor. \nStarting a startup activity is only allowed after the Departmental Committee for DPE approves. The Departmental DPE Committee will evaluate the startup project and award DPE units at the end of the startup period.\nIf the startup project is in an area that is not within the expertise of the student's parent department, the DPE Committee may involve faculty members from other departments, centers, or schools to assess and supervise the project.\nIf a student earns DPE units through a startup, that semester will be a registered semester for graduation requirements. However, if the DPE committee does not approve the award of 5 units for the startup activity, that semester will not be considered a registered semester.\nSteps to apply:\n1)Student has to raise request online for prior permission with Prior approval\nof Institute DPE Committee on recommendation from DPE committee of Student’s Department\n2) Completion of approval request by student forwarded through faculty mentor \n3) Evaluation and Moderation by the DPE committee of the Department / Institute\nDid you guys know about the concept of Deferred placements and breaks beforehand, or did you come to know it through us? After knowing all this, you must be wondering, do students opt for the deferred placement or semester break? How do they manage to convince their parents, and what difficulties do they face in making that decision?\nYes, they do, and we present to you all some snippets of talks that the editorial team of eDC had  with students who are opting for deferred placements this year.\n1.) Dnyaneshwar Prashant More\nOur Core Team Member of eDC, Dnyaneshwar, is a dedicated 4th-year B.Tech student in the electrical department. His significant role within eDC showcases his commitment and expertise, making him an integral part of our team.\nHe's developing an innovative AI tool that lets viewers customize their content experience on OTT platforms, ensuring a safer and more enjoyable viewing experience without compromising the overall narrative or content quality.\nThis year, he has applied for deferred placements and aims to take his startup to greater heights. The editorial vertical had an enlightening conversation with him where he shed light upon various aspects of forming a startup and how IITD helped him in the journey.\nQ1: Why do many first-year students initially aspire to startups but ultimately choose to pursue conventional employment?\nFirst-year enthusiasts are often influenced by the rat race of high-paying placements and the peer environment. Some who attempt startups may lack the dedication required, while others face challenges in securing parental support, which can hinder their entrepreneurial aspirations. These factors collectively contribute to the shift toward traditional job opportunities.\nQ2: Why did your first startup fail?\nDuring his second year, he and his team identified an opportunity amidst the Ukraine-Russia war—a wheat shortage in Egypt. They embarked on an idea to bridge the gap by transporting wheat from India to Egypt. While they made initial progress, they soon realized that the challenge was more complex and risky than anticipated. Moreover, additional government restrictions further impacted the business, ultimately leading to the closure of this idea.\nQ3: Major difficulties in running a startup, and how do you manage them?\n In the context of academics, he places his startup as the utmost priority, dedicating post-class hours to the office. Driven by ambition, he's on the quest for like-minded individuals who share his passion and persistence. The journey includes the pursuit of assembling the right team, reflecting his unwavering commitment to solving challenges and driving the venture forward. \nQ4: How do you validate your idea enough to work on it? How can the validation process be further strengthened?? \nDiscussion and surveys serve as the initial pillars for validating an idea. They provide crucial insights into consumer sentiments. For entrepreneurs, engaging with a diverse range of individuals deepens clarity. Moreover, building an MVP with available resources not only attracts investors but also reinforces idea validation, reflecting the proactive entrepreneurial spirit at the core of the process. \n Q5: Most successful startups were run by people 25 and above. Why did you decide to do it now?\nHe embodies the passion of grabbing opportunities, understanding that waiting can mean missed opportunities. He conducted thorough research, identifying a genuine problem. Fueled by a passion for innovation and action, he chose to take the initiative, realizing that many potential entrepreneurs falter by hesitating, making action the path to problem-solving.\nQ6: Why would a giant company take your plugin when it can make one independently?\nLarger companies often grapple with extensive, time-consuming projects, making it challenging to meet their commitments. He showed an example of Caption Max, a service that assists major companies by providing captions and introductions for films. His vision is to bridge the gap similarly, and he noted that there are OTT platforms that have shown a positive inclination toward their idea.\nQ7: How were the experiences in the process of deferred placement?\nHe found the process tiring and had room for improvement regarding coordination between the Administration and FITT. However, he managed to navigate the process, although with some effort, successfully. Once the form-filling was complete, the presentation became a relatively straightforward task. The committee, comprising members from FITT and IITD administration, posed questions aimed at understanding the current stage of the startup and assessing the potential of the team. They also inquired about the plans for the next 2 years and the project's sustainability.\nQ8: Why did you choose deferred placement over a semester break?\n He discouraged the idea of taking a semester break, emphasizing that it may potentially lead to becoming a complete college dropout, making it significantly more challenging to return and complete the courses. He stressed the importance of obtaining an IIT degree as a valuable safety net, recognizing its potential to open doors if entrepreneurial endeavors don't unfold as planned.\nDisclaimer: We have taken very much care in providing the correct information but we request you to go through official institute policies once before taking any further steps.\nThanks for being with us till here.\nAs you embark on your entrepreneurial path, remember that there's no one-size-fits-all approach. It's about discovering what resonates with your passion and skill set. So, take that first step, learn from your experiences, and don't be afraid to follow your dreams. The world of entrepreneurship is waiting for you to make your mark. Goodbye for now, and stay inspired!\nEditorial Team eDC, IIT Delhi"
  },
  {
    "title": "Supercharging Success: The Thrilling Journey from IIT Classrooms to Million-Dollar Marvels",
    "link": "https://edciitdelhi.substack.com/p/supercharging-success-the-thrilling",
    "published": "Wed, 04 Oct 2023 21:23:49 GMT",
    "content": "Greetings to everyone ,\nIn this newsletter edition, we're thrilled to introduce a special interview featuring Kartik Hajela, the visionary founder behind Log 9. In this exclusive conversation, let's dive deep into his remarkable journey and gain valuable insights into the realms of entrepreneurship, sales, and the ever-evolving world of electric vehicles (EVs). Ready to embark on this exciting journey with us?\nTable of Contents:\nQuestion 1: \nCould you share the journey of Log9, including its phases as an \nOil Spill Decontamination, Cigarette Filter, and Coronavirus Disinfectant startup\n before 2015?\"\nQuestion 2: Deep tech enterprise sales: \nDeveloping a solution is one thing and selling it to a big organization is just another ball game, how did you crack the sales in this space? \nQuestion 3: \nCan you provide an overview of opportunities in both \nmaterial technology and the EV sector in India,\n along with insights into upcoming opportunities for interested individuals?\nQuestion 4: \nDeep tech is a new choice for VCs these days. Since you have raised from India’s top institutional investors, can you tell us how the \nFunding scenario \nis different for the Deep tech start-ups than the normal ones? \nHighlights:\nEntrepreneurial Journey:\nAn exciting journey was embarked upon by Kartik and his friends from IIT Roorkee. It began with the delivery of street food but swiftly transitioned into the electric vehicle industry. Presently, their company boasts one of the largest patient bases in India. Let's delve into their remarkable story!\nCracking Enterprise Sales:\nKartik offers invaluable guidance to budding entrepreneurs: Concentrate your efforts on comprehending the specific needs of your customers and aim to solve the challenges that even the established market leaders have not yet tackled. This approach not only fosters innovation but also presents an opportunity for your start-up to stand out and make a significant impact in the industry.\nOpportunities: \nKartik passionately emphasizes the wealth of deep tech opportunities awaiting exploration. From the realm of climate tech, he points out intriguing challenges that remain unsolved, such as the quest to minimize energy loss when storing thermal energy. \nIIT Life Lessons:\n \nKartik’s time at IIT Roorkee, filled with college events and academic hurdles, gave him essential life lessons. These experiences equipped him with valuable skills in forging meaningful connections and earning people's confidence.\n1] Journey of building log 9:\nIt all began in 2012 when it was my first IIT JEE attempt. Unfortunately, I failed the first time, but I didn't give up. I tried again and finally secured a spot in the Chemical Engineering branch at IIT Roorkee. \nTowards the end of my second year, \nI decided to take a different path. Instead of applying for internships\n, I drew inspiration from Zomato and focused on aggregating street food. We faced numerous challenges, working tirelessly in our room for two and a half months. While we didn't achieve tangible results, this experience provided invaluable insights into ground operations.\nAt the start of my third year, I embarked on an internship at ITC, where I discovered my passion for hardware. I tackled the issue of air bubbles in pens. Subsequently, we joined the incubation program at IIT Roorkee as the first incubates from our college. This was made possible because we secured initial funding. We decided to work on a small project involving a cigarette filter catalyst using graphic components. \ncigarette filters were just a starting. \nThen, in 2017, drawing inspiration from commercial two-wheelers, we set our sights on electrifying them and developing innovative solutions to decrease the charging\ntime and improve the battery cycle life. We bought our first-megawatt research line through Ather. We first started working on how to make a cell then we did super caps(capacitors) and then finally entered the lithium-ion market now we have scaled up and become India’s biggest cell line and cell manufacturing with a team of more than 650 people.\n2] “How did you master the art of selling cutting-edge tech to corporate giants? Share your winning strategies!”\nOur approach involved two key steps. Firstly, we embarked on a comprehensive journey to thoroughly understand the \nmarket's unique requirements and preferences\n. This allowed us to gain crucial insights into \nwhat customers truly needed and desired.\nSecondly, we strategically cracked a product that could cater to a vast and diverse customer base. For example, when developing a battery for four-wheelers, we recognized the immense market potential. By focusing on a product that addressed this widespread need, we aimed to make a significant impact.\nAs a testament to our commitment to innovation and customer satisfaction, we proudly became the first company in India to offer a buyback guarantee on our batteries.\n This pioneering initiative not only showcased our dedication to customer-centric solutions but also set a new industry standard, reaffirming our position as a leader in the market\n.\n3] Deep tech is a new choice for VCs these days. Since you have raised from India’s top institutional investors, can you tell us how the Funding scenario is different for the Deep tech start-ups than the normal ones?\nThe last decade was all about digitization, but now, we're in an era defined by renewable energies, climate tech, deep tech, and space tech. This site has venture capitalists rethinking their game plans.\nWhy? Because they've discovered that in the digital realm, a lot of cash gets poured into human resources. But in deep tech, investments translate into tangible, lasting assets. Over the past seven years, deep tech has matured remarkably. Take our journey, for example, \nsecuring funding from Amara Raja—a ground-breaking move in the energy sector\n. In contrast, the e-commerce arena often burns through capital, especially when battling industry giants. \nThat's why VCs are increasingly seeing deep tech as a haven for comparatively lower-risk investments\n.\n4] \nOpportunities\n. Can you provide a brief overview of the current landscape in material technology and the electric vehicle (EV) sector in India, and what are the upcoming opportunities that individuals can explore in both these fields?\n\"Exploring Deeper Energy Efficiency: While electric vehicles grab the limelight in our energy quest, it's startling to know that a substantial 40% of energy vanishes during heating and cooling processes. Why the double conversion of energy into electricity and back to heat? \n Thermal energy storage can be an innovation poised to reshape energy management.\nPicture a world where surplus heat from energy production or industries is captured, stored, and later used. This slashes waste, boosts energy efficiency, and trims costs.\nShifting gears to solar energy, organic solar cells are emerging as an affordable game-changer. They democratize solar power, making it more accessible, cost-effective, and eco-friendly.\nBut the journey doesn't end there. \nCarbon capture is also making waves\n. We're reimagining captured carbon dioxide as cleaner, greener fuels, envisioning a future where carbon becomes a valuable resource, guiding us toward a cleaner and sustainable world.\nIn a nutshell, these innovations—\nthermal energy storage, organic solar cells, and carbon capture\n—illuminate a path to superior energy efficiency, environmental responsibility, and economic sustainability.\"\nAttendees questions :\nAmar Dixit\n : Does the production of batteries for electric vehicles (EVs) inherently cause more damage to the environment?\nKartik\n: Tailpipe emissions arise from petrol combustion, while bill of material (BOM) emissions are associated with battery production. Notably, BOM emissions decrease throughout the battery's lifecycle, resulting in significantly lower emissions per unit of energy compared to petrol combustion. Consequently, there are ongoing efforts to extend battery lifecycles to 20 years, effectively spreading and reducing emissions over that extended period. When considering today's scenario with the current grid mix, EVs may appear to be more harmful to the environment because of the shorter lifecycle batteries (around 3 to 4 years) but if we talk about long-lasting batteries like lithium-titanium batteries with a lifespan exceeding 20 years, coupled with cleaner energy grids, EVs can become a more environmentally friendly and cheaper fuel in terms of emissions.\nAryan\n : I am a fresher at IIT Delhi and interested in start-up but don’t have idea what should I do can you guide me so that I work on some start-up from the second year itself .\nKartik:\n In my opinion, a start-up can certainly be a viable career choice, but one should avoid becoming too entrenched in it. The key is to identify a problem with which you can resonate and which can provide the driving force to keep you engaged, as it won't be an easy journey without that motivation. The essence of it is that you must possess a strong motivation that keeps you determined to solve that problem.\nDuring the first year, your focus should be more on exploration. You should concentrate on curating the right resources that you can digest. Use this time to create a pipeline of data and articles that will help you stay informed about current events and trends in the world, especially those that align with your interests and the problem you aim to address.\nSpecial Thanks to Kartik Hajela :\nWe extend our sincere thanks to Kartik for sharing his remarkable journey and insights with us. Your wisdom and experiences are a true inspiration to our readers. Your openness about the entrepreneurial challenges you've faced enriches our community. We appreciate your valuable contribution to this edition.\nAt last ,\nThanks to everyone for being with us through the newsletter, we promise and assure to bring more quality content shortly. Until then, \nsigning OFF\nArticle by\n :\nShashank Choudhary\n \n(eDC Startup Support Co-ordinator)\nShaurya Kumar Maurya(eDC editorial executive)\nAyush Sharma\n (\neDC\n \neditorial Co-ordinator\n)\nIn Attendance:\nAmar Dixit(Overall mentor)\nSameer Akhtar( Overall  Co-ordinator)\nDnyaneshwar (  CTM )"
  },
  {
    "title": "How Years of Perseverance built an Innovative Biotech Startup out of India: In talks with Tuhin Bhowmick, Co-Founder, Pandorum Technologies.",
    "link": "https://edciitdelhi.substack.com/p/how-years-of-perseverance-built-an",
    "published": "Thu, 07 Sep 2023 15:52:06 GMT",
    "content": "Context\n: Many of you are unaware of how the deep tech startup ecosystem works. These startups do not follow a fancy path of quick money, instead, they persevere to build revolutionary products for years, keeping the next 10 years in mind. For example, OpenAI worked in stealth for years before they came out with ChatGPT. This episode with a deep tech entrepreneur from a core department and many more to come aim to develop a scientific temperament to pursue your core engineering field through entrepreneurship.\nShashank: \nCan you give us a Brief Intro about yourself and your startup, Pandorum Technologies?\nTuhin: \nPandorum is a \nTissue Engineering and Regenerative Medicine\n startup which has built regenerative tech for the Liver and Lungs for research purposes and our flagship product is \nBioengineered Cornea\n which can treat Blindness.\nI did my PhD from IISc Bangalore and later got incubated through BIRAC. Later, we raised funds from Angel investors like Sachin and Binny Bansal(Flipkart) and other institutional investors. Now, we are a team of 35 scientists with two R&D Centers in Bangalore and the Bay Area, USA and two Clinical Translation centers in Delhi and Northwestern University, USA.\nShashank: \neDC is involved with many undergrads and post-grads students but we see very few PhD candidates getting involved in the startup. What made you choose this path?\nTuhin: \nWhen I was doing my PhD from IISc, my plan was to dive into science and become a faculty. I was from the Physics dept. and took many courses in Crystallography.\nI didn’t even know what a Business model is or how to make one.\nThe shift to entrepreneurship was due to a very core personal reason. My father was diagnosed with Lung Cancer and after a fight for 9 months, we started to lose hope.\nI found a research paper from Ashwagandha with an innovative medicine to cure that cancer. I showed that to the Oncologist. He appreciated the efforts but said that they were using a 20-year-old medicinal cure and this sort of new cure will take at least 20 more years to come to patients finally. I saw this huge gap between research and advanced application.\nIt made me question that,\n“What is the point of doing all this science if it cannot be utilized to treat human suffering?”\nShashank:\n You mention that gap between research and application. How do you think one can bridge that gap?\nTuhin: \nThis transition happens in two parts, one is from Research to Clinical Success and from Clinical Success to Commercial Success. You don’t build this in sequence, you build it in parallel. \nWhile you are building the product, you have to keep the target patient, its market size, the differentials and the challenges in mind. One thing which is mandatory for all such startups like ours is Empathy. If I ask myself the question of whether I will use this product on my mom and the answer is yes, then the product has my confidence. We are one year away from clinical trials of our liquid cornea product and it has been a super fulfilling journey until now.\nAlso, a very important aspect of product building is the team. We are a team of PhDs, Post Docs and MDs and for most of them, we are their first company. \nShashank: \nBy now, we understood the motivation to dive into the startup world. But, how did you start your venture in 2010?\nTuhin: \nDuring the time my dad was admitted, I was constantly looking for some income source. This is when my friend, now Co-founder Arun, told me about the Biotechnology Entrepreneurship Team(BEST) Competition which was ₹5Lakh as the first prize. We applied for it and came first.\nDue to this, we happened to visit the Department of Biotechnology(DBT) and the Secretary of DBT asked me one question, “Are you having fun?”. Now, I understand the importance of that line, because things get so tough down the line and why would someone do something which is so consuming at all levels and demands too many sacrifices? All these FDA approvals have come at a cost of sacrifices. But why did we do it? \nBecause at some core level, we were having fun!\nShashank: \nYou mentioned the BEST program. Do you think Govt. grants and initiatives like these help and if yes, then can you name any?\nTuhin:\n So in 2011, we registered the company and took a proposal of ₹3cr. to develop a “bio-ink” which can be used to mimic cornea, liver and skin.\nIn 2012, \nBiG\n (Biotech Ignition Grant) was launched by \nBIRAC\n (Govt. of India) which generously funds these kinds of Scientific projects. If you’re from a basic science background and have come up with an application concept, you can apply it to initiatives like BiG. We were funded ₹50 Lakhs by BiG in 2012. \nLater, we also got into \nSIBRI\n, again by BIRAC. This kept us going and by 2014, we developed Liver MicroTissue, which was something very few people had done in the world at that time.\nShashank:\n By now, we have a fair idea of your journey of starting up. How did you come up with this recent product of yours, Bioengineered Cornea?\nTuhin: \nBy 2016\n, \nWe developed the technology to accommodate the heterogeneous distribution of cells in liver tissue at a micro level, which was recognised by Sachin and Binny Bansal and this is when we raised our seed round.\nWe had options to get into multiple applications of this technology like Lungs, Brain or Skin but we chose to focus only on the cornea because a single product with 6mm of diameter and half mm of thickness can give a great deal of peripheral as well as central vision to the patient. Since 10 ml of mass can cure up to 3000 patients, this has inherent scalability over large tissues like Skin where 10ml of the same can print only a few square inches of skin tissue.\nShashank\n: Coming to the last and very important question, \nOpportunities\n. Can you map the whole Biotechnology space for us in brief, in India and Abroad? Where do you see the upcoming opportunities?\nTuhin:\n Since I have worked in a specific discipline of Biotechnology. I do not feel I am qualified to give this answer. But still, I can try.\nBiotechnology is a massively diverse industry. On one side, we have medicine and on the other, we have Bioenergy. \nMy co-founder was also from Aerospace and was working on developing next-generation rocket fuel using a catalyst which used mesoporous nanoparticles which optimized surface area v/s mass.\nComing back to the point, I would rather recommend a very nice podcast by Nikhil Kamath with Kiran Mazumdar Shaw, India’s Self-made Richest Woman. I was surprised to see our logo during the podcast.\nFinal words by Team eDC\nThe sole aim of this series is to discover the opportunity in the intersection of your core department and entrepreneurship. Through these entrepreneurs, we bring you an insight into their journey and prescribe opportunities.\nThis session with Mr. Tuhin Bhowmick might feel a little technical for some. Still, Famous entrepreneurs expect students from India’s premier institute to have a sense of curiosity to know more about something which they have no clue about. This is what makes us good engineers.\nStay tuned for upcoming episodes from different sectors such as EV tech, space tech, material tech, climate tech, semiconductors and many more.\nFor feedback and criticism, you can mail us at startup@edciitd.com.\nIn attendance:\nShashank Choudhary\n(Co-ordinator, Startup Support)\nAyush Sharma(Co-ordinator, Editorial)\nKhushi Singh\n(Member, iGEM IITD)\nChinmay Yadav\n(Executive, Editorial)\nShivi Sisodiya (Executive, Editorial)\nAdditional Links:\nBIRAC (Check Programmes Menu): https://www.birac.nic.in/\nFITT-IITD Incubator: https://fitt-iitd.in/web/government-program\nList of Dept. of Biotechnology and Biochemical Engg professors: https://beb.iitd.ac.in/faculty.html\nPandorum coverage on inc42: https://inc42.com/buzz/exclusive-biotech-startup-pandorum-technologies-raises-over-inr-41-cr/"
  },
  {
    "title": "All you need to know about building a startup straight out of college: In conversation with Adit Jain",
    "link": "https://edciitdelhi.substack.com/p/all-you-need-to-know-about-building",
    "published": "Fri, 01 Sep 2023 14:20:09 GMT",
    "content": "Greetings to everyone ,\nIn this edition of our newsletter, we bring you an exclusive interview with Adit Jain, the founder of Leena AI. Adit shares his journey and invaluable insights into the world of entrepreneurship, SaaS, and AI.\nTable of Contents:\nQuestion 1: Adit’s Journey and how did Leena AI come into the picture?\nQuestion 2: What does this sector hold for us? Where do you see the upcoming opportunities in this unique intersection of Enterprise SaaS and AI.\nQuestion 3: The biggest challenge young entrepreneurs face in the SaaS sector is to crack Enterprise Sales. How did you do it to land yourself in the meeting rooms at top companies?\nQuestion 4: Your YC experience and advice for those applying in it?\nQuestion 5: Which is better to learn by doing or do after learning?\nQuestion 6: Your life while in IIT and how did you learn from it?\nHighlights:\nEntrepreneurial Journey:\n Adit Jain and his IIT Delhi hostel mates ventured into the tech world after trying their hand at grocery delivery, leading to the creation of ChatterOn and eventually Leena AI, a specialized HR-focused solution for large enterprises.\nAI Opportunities in Enterprise SaaS:\n Adit emphasizes that AI has the potential to disrupt large enterprise workflows, but success lies in understanding the willingness of these companies to embrace change. Identifying common challenges through conversations with companies is the key to targeting opportunities effectively.\nCracking Enterprise Sales:\n Adit's advice for young entrepreneurs in SaaS includes a readiness to learn from failures, starting small with pilot projects, and positioning themselves as eager problem solvers rather than expecting large deals right away.\nYC Experience and Application:\n Adit highlights the transformative experience of Y Combinator (YC), emphasizing the importance of being genuine in the application process and showcasing traction if it exists. He also notes that YC is just one path to success, with countless opportunities for learning within the country.\nLearning by Doing vs. After Learning:\n Adit believes there's no fixed timeline for entrepreneurship. The right time to stop or pivot varies for each individual. He stresses the importance of focusing on fundamentally sound startups for higher chances of success.\nIIT Life Lessons:\n Adit's college days at IIT Delhi, including involvement in college politics and academic challenges, taught him valuable skills in building strong relationships and winning people's trust – skills that have greatly contributed to his success in sales.\nIn a brief session of more than 1 hour we tried to gather as much information and knowledge from our own Alumni \nAdit Jain ( Founder of Leena AI) . \nHere , we are to share the words of Mr. Adit Jain through our news letter.\n#1) Adit’s Journey and how did Leena AI come into the picture?\n \nWell, you see, it all began back in our college days at IIT Delhi. My friends Anand Prajapati, Mayank Goyal, and I were hostel mates, sharing not just rooms but a deep passion for technology and a dream of building something of our own. In our final semester, we dabbled in the grocery delivery sector, but it soon became apparent that turning a profit was no walk in the park.\nIn 2015, my companions and I embarked on a new journey by founding ChatterOn. This platform provided a no-code solution for building chatbots, and it was a fascinating challenge. The initial years were financially trying but instrumental in shaping our character and teaching us invaluable lessons.\nBy mid-2017, \nChatterOn\n had grown to have thirty thousand users, which was quite motivating. However, there was a catch – our users were struggling to scale on the platform and provide excellent conversational experiences. It was then that we had our 'eureka' moment. Out of those thirty thousand users, only twenty were using the platform to its full potential, and a significant seventeen of them were utilizing it for internal purposes like HR, finance, and IT. This realization led to the birth of Leena AI.\n#2) What does this sector hold for us? Where do you see the upcoming opportunities in this unique intersection of Enterprise SaaS and AI.\n \n I believe that the intersection of Enterprise SaaS and AI holds immense potential. It's a sector where all large enterprise workflows are on the brink of disruption. These enterprises often face issues that can be effectively addressed through the integration of large language models and AI.\nInterestingly, the challenges in large enterprises are rarely due to a lack of technology but rather a reluctance to embrace change. To identify these opportunities, I emphasize having conversations with companies. Just a brief twenty to thirty-minute chat with multiple companies can provide profound insights into their operations. When you start hearing similar challenges echoed across different companies, it becomes a clear signpost for what to target.\n #3) The biggest challenge young entrepreneurs face in the SaaS sector is to crack Enterprise Sales. How did you do it to land yourself in the meeting rooms at top companies?\n \n To crack enterprise sales, you need to be prepared to fail, especially in the beginning when you're learning the ropes. In my case, I've been involved in sales right from the inception of Leena, and even earlier during my time at ChatterOn.\nWhat's crucial is approaching these meetings with a learning mindset, not just a selling one. Leverage whatever advantages you have, such as the IIT tag, to open doors. Show your eagerness to learn and improve. Being honest about your limitations and demonstrating the hunger to overcome them play a pivotal role in sealing the deal.\nShow potential clients that you're actively involved in your field and that you're enthusiastic about collaborating to solve their problems. It's often a good idea to start small with a pilot project and then build from there. Repeat this process multiple times, and you'll gain the expertise to succeed in sales.\nDon't enter these meetings expecting a hefty check right away; that's not how it works. Companies are more willing to experiment with eager young entrepreneurs but may be hesitant to dive into big deals right from the start. Position yourself as a hungry young entrepreneur keen on solving real-world problems and eager to learn throughout the process.\n#4)Your YC experience and advice for those applying in it?\n \nParticipating in Y Combinator (YC) was an incredible experience for our team. It provided us with invaluable access to the American market and audience, which was particularly beneficial for our sales efforts. Understanding your potential buyers is crucial, and YC significantly expanded our exposure to international markets.\nWhen applying to YC, it's vital to be genuine and honest. If you have traction, whether it's users, revenue, or GMV (Gross Merchandise Volume), be sure to highlight it and showcase trends of growth over the past quarters or year. This information will strengthen your application and increase your chances of acceptance.\nHowever, it's worth noting that not making it into YC doesn't mean you can't build a successful company. Many exceptional companies today never went through YC, and their outcomes weren't adversely affected.\n#5)Which is better to learn by doing or do after learning? \n There's no one-size-fits-all answer to this question. People have started their entrepreneurial journeys at various points in their lives and achieved remarkable success. What truly matters is recognizing when it's the right time to pause or pivot.\nIn my case, I began a grocery delivery company in college, but I eventually decided to shut it down. The challenges of making a profit with little certainty were significant. Now, I believe in creating fundamentally sound startups with a higher likelihood of success.\nIt's entirely okay to take a break and reflect before embarking on another idea. There's no predefined timeline that fits everyone; it varies from person to person.\n#6)Your life while in IIT and how did you learn from it?\n(As soon as the the ques was asked the huge smile that appeared on his face told us the amount memories he has made on campus during his days)\nAh, my time at IIT Delhi was quite a ride. I was actively involved in the world of IIT Delhi politics, or \n\"poltu\"\n as we called it. Academically, I had my ups and downs, struggling to maintain a 7.5 GPA, often humorously referred to as \n\"saade satti.\"\nBut let me tell you, I wouldn't trade those hostel days for anything else. My experiences in college politics taught me how to build strong relationships, and these skills have proven invaluable in my journey as an entrepreneur, particularly in sales.\nI'm a people's person, and I know how to win trust and connect with others on a deep level. Those college experiences continue to shape my approach to business and life.\nBy this we come to the end of this newsletter and snippets of our conversation with alumni of our college Mr. Adit Jain . \nSpecial Thanks to Adit Jain\nWe extend our sincere thanks to Adit Jain for sharing his remarkable journey and insights with us. Your wisdom and experiences are a true inspiration to our readers. Your openness about the entrepreneurial challenges you've faced enriches our community. We appreciate your valuable contribution to this edition.\nAt last ,\nThanks to everyone for being with us through the newsletter , we promise and assure to bring more quality content in near future. Until then , \nsigning OFF\nArticle by\n :\nShashank Choudhary \n(eDC Startup Support Co-ordinator)\nChinmay Yadav (\neDC editorial executive\n)\nAyush Sharma (\neDC\n \neditorial Co-ordinator\n)\nVaibhav Sobti( \neDC\n \nGraphic Co-ordinator\n)"
  },
  {
    "title": "eDC Weekly!",
    "link": "https://edciitdelhi.substack.com/p/edc-weekly-13e",
    "published": "Tue, 15 Aug 2023 09:16:33 GMT",
    "content": "India, Independence and Entrepreneurship\nOn August 15, 1947, India won freedom\n.  \nIt marked a moment when even building up this whole big nation was an experiment, and we didn’t know what the future held.\n \nToday, we celebrate the 76th anniversary of India's Independence Day. Over these decades, India has embarked on a remarkable journey of reconstruction, innovation, and advancement.\nAmidst this resplendent saga, entrepreneurship has always been a guiding star, illuminating the path towards self-reliance and economic prowess. \nFrom the bustling city streets, where dreams of commerce and trade rise high, to the serene landscapes of villages, where artisans weave stories into intricate handicrafts, India's entrepreneurial journey has been a celebration of diversity and tenacity.\n \nThe land of the Vedas and the birthplace of great civilizations, India's entrepreneurial spirit mirrors the tapestry of its ancient past, where innovation was revered and trade routes spanned the known world.\nToday, as we traverse the vibrant corridors of modern India, we witness the rise of startups and visionary leaders, shaping industries and scripting narratives of innovation that reverberate globally. India's tech hubs, its creative hubs, and its ambitious ventures all stand as a testament to the unyielding pursuit of excellence, echoing the very essence of what it means to be an entrepreneur - \nto dare, to innovate, and to uplift.\nIn this special edition, we explore the vibrant tapestry of India's entrepreneurial spirit post-independence in a captivating odyssey. Along the way, we uncover two intriguing tales of entrepreneurship:\n the cooperative revolution of Amul and the innovative prowess of Tonbo Imaging.\n Furthermore, we are unravelling\n the impactful potential of government schemes for fostering entrepreneurship.\n10x Scaling IIM Bangalore (with eDC):\n10xScaling\n is a special program created by IIM Bangalore and \"xto10x,\" in partnership with eDC, designed to help you achieve remarkable growth in the \nscaling of startups\n.\n Beyond a course, \nit's a tailored launchpad for visionary leaders\n. With real-world insights and frameworks from 300+ startups, \nBinny Bansal\n's guidance heralds a universe where scaling is an art. Explore stories from successful startup leaders like \nRahul Chari (PhonePe), Abhay and Vivek (Licious), and Vidit Aatrey (Meesho)\n. \"10xScaling\" changes the way you understand scaling and provides a path to becoming an expert in startup growth.\nMore about this @ \n→ ​​\nhttps://info.xto10x.com/scaling\nAmul: The \nTaste\n Case of India\nAmul's story is, rightly, the story of India. In 1946, India was still under British rule. The company named ‘Polson’ had a monopoly over milk processing and distribution, under which farmers were bound to sell milk to the company at arbitrary prices. With inspiration from Sardar Patel, the organisation of Morarji Desai, and under the leadership of Tribhuvandas Patel, farmers established a cooperative named 'Kaira District Co-operative Milk Producers Union Limited' (KDCMPUL) in a village called Anand.t Co-operative Milk Marketing Federation Ltd. and the brand Amul was adopted by GCMFL.\nAmul played a significant role in the White Revolution of India, also known as the Operation Flood programme, which \ntransformed India from a milk-deficient nation to one of the largest milk producers in the world, improving the livelihoods of millions of farmers and boosting the country's dairy industry.\n Amul's impact is far-reaching, showcasing the triumph of cooperative collaboration, technological innovation, and economic empowerment. As the cooperative model flourished, it gave rise to a paradigm of entrepreneurship deeply ingrained in \nIndia's socio-economic fabric\n. Today, the legacy of Amul not only symbolizes the monumental success of the White Revolution but also serves as an enduring source of inspiration for aspiring entrepreneurs across the nation. It exemplifies how a visionary venture can revolutionize an industry, uplift lives, and propel a nation to unprecedented heights.\nHere we are with a small breakdown of it all:\nThe Cooperative Paradigm:\n \nAmul, also known as the Gujarat Cooperative Milk Marketing Federation (GCMMF), was founded in 1946 by farmers in Gujarat\n. It established a cooperative model where small farmers pooled their resources and collaborated to improve milk production, processing, and marketing. This promoted the idea of farmers' cooperatives across the country.\nMilk Collection and Processing:\n Amul set up a well-organized network for milk collection from rural areas. This network facilitated the efficient collection and transportation of milk from small-scale farmers to processing plants.\nTechnology and Processing:\n Amul invested in modern dairy technology and processing methods, which helped increase the shelf life of milk and dairy products. This minimised wastage and ensured a regular supply of quality products.\nDairy Infrastructure Development:\n Amul played a significant role in the establishment of dairy processing plants, cold storage facilities, and other dairy-related infrastructure. This infrastructure development was necessary for handling and processing the increased milk production resulting from the White Revolution.\nEconomic Empowerment:\n The success of Amul's cooperative model led to increased income for dairy farmers, which had a positive impact on rural economies. This economic empowerment of farmers aligned with the broader goals of the White Revolution to uplift rural communities.\nFascinated by the story? Have a look at these links!\nA Look Into Amul Marketing Strategies: Branding Strategies and Marketing Mix!\nWhat is a Cooperative Business?\nDefence Startups: Under the Lens\nWhile startups are usually associated with their commercial aspects, have you ever considered their potential to contribute to national defence issues?\n  Carrying forward the feelings of patriotism we feel on Independence Day; we would love to present before you a startup that is actively working to help boost national security.\nTonbo Imaging is one of the innovative startups that are actively bolstering India's path towards self-reliance, especially in the defence sector. This pioneering company, established by visionary engineers Rahul Trivedi and Ankit Agarwal, originated from the prestigious Indian Institute of Technology, Bombay, reflecting the very essence of Indian innovation.\nThe thermal imaging cameras developed by Tonbo Imaging have emerged as indispensable assets for our armed forces, being relied upon by the Indian Army, Navy, and Air Force for critical operations, including surveillance, target acquisition, and enhanced night vision capabilities. Beyond their essential role in defence, these cameras find equal importance in law enforcement and other government agencies, showcasing their versatile utility.\nWhat truly sets Tonbo Imaging apart is their proprietary core technology, a genuine testament to Indian inventiveness. By seamlessly integrating high-performance optics, advanced signal processing, and tailor-made electronics, they've engineered thermal imaging cameras that not only outperform their traditional counterparts and stand out for their compactness, portability, and affordability, representing a remarkable engineering achievement.\nThe Indian government acknowledges the pivotal role played by startups like Tonbo Imaging, extending substantial support that aligns seamlessly with the nation's aspirations for defence modernization. Having secured over $10 million in funding from esteemed investors such as Sequoia Capital India and Qualcomm Ventures, Tonbo Imaging is a shining example, proving that Indian innovation has the potential to lead the way in technology.\nThis Independence Day, let's extend our salute to Tonbo Imaging and the numerous other outstanding startups diligently working towards making India self-reliant in the defence sector. They embody the very spirit of innovation, resilience, and determination that will define the trajectory of our nation's defence capabilities, marking a significant milestone in India's progressive journey towards an “\nAatmanirbhar Bharat.”\nAs we celebrate our nation's independence, let us acknowledge not only the valorous efforts of our defense forces but also the trailblazing contributions of these innovative defense startups. By supporting and nurturing this ecosystem, India not only strengthens its self-reliance but also creates avenues for economic growth and technological prowess.\nThis YouTube video below takes a look at India’s defence startup system and shows the growth of this Indian industry in recent times\n!\nEmpowering Entrepreneurship: Navigating India's Flourishing Business Landscape\nDo you think starting a startup is a daunting task? Not necessarily, especially when you consider the multitude of available resources to aid you. We're here to demystify and provide you with the tools to harness government schemes, facilitating the growth of your business.\nThe world of MSMEs (Micro, Small, and Medium Enterprises) is evolving, and India's government schemes are lighting the path for entrepreneurs. From financial support to global opportunities, these schemes blend innovation with streamlined regulations, creating an environment ripe for business growth.\nLearn more about MSME opportunities:\nLendingkart - MSME Loans\nMake in India - MSME Schemes\nStartup India:\nDive into the innovation odyssey supported by the government through \"Startup India.\" This transformative initiative is your ticket to unlocking mentorship, funding, and growth incentives.\nLearn more at:\nhttps://www.startupindia.gov.in/content/sih/en/about-startup-india-initiative.html\nhttps://www.startupindia.gov.in/content/sih/en/international/go-to-market-guide/government-initiatives.html\nIIT Delhi student?\nIIT Delhi boasts a legacy of nurturing groundbreaking startups. Are you an aspiring entrepreneur within its hallowed halls? Here's a peek into some game-changing schemes waiting to fuel your innovation:\nGovernment initiatives like the \"Atal Innovation Mission\" and \"Smart India Hackathon\" are catalysts for funding, mentorship, and skill development.\nDeferred placement\n is an option provided by IIT Delhi that allows students to defer their on-campus placement and work on their startup venture instead. If the startup doesn't succeed, students can choose to return and sit for placements within the next \ntwo years\n. This programme is available to all eligible students, irrespective of their branch or academic performance. This option allows students to pursue their entrepreneurial aspirations while still having the safety net of returning to the traditional placement process if needed.\nYou can read more about these at the following links:\nhttps://www.aim.gov.in/\nhttps://www.sih.gov.in/\nhttps://fitt-iitd.in/web/government-program\n \n(must read for the students)\nUnfurling IIT Delhi's Patriotism: SWATRIC'S Flag of Triumph!\nAmidst soaring nationalism this Independence Day, the IIT-Delhi campus proudly boasts the monumental 108-ft national flag at Himadri Circle, a paragon of patriotism, unity, and technological prowess. Crafted by IIT-Delhi's startup SWATRIC, this colossal Tiranga symbolizes our nation's spirit and engineering prowess. Guided by Professor Bipin Kumar, the flag boasts 30% less weight yet stronger seams, a triumph of Indian innovation. SWATRIC's saga extends to designing fabric flags across India, led by CEO Ranu Khade and Professor Bipin Kumar. A blend of technology and tradition, this legacy endures diverse climates, embodying India's unyielding spirit. As we celebrate, gaze not only at the skies but also at this IIT Delhi masterpiece—a tapestry of innovation and patriotism, reminding us of India's soaring resilience\nTEDx Talks; \nNurturing India's Village Entrepreneurial Oasis\nManav Subodh envisions India as a Silicon Valley for rural entrepreneurs, uniting inclusivity and triumph in his compelling TED Talk. From 200+ villages, he sparks a movement, redefining entrepreneurship and urging audacious dreams for a thriving India. \nWatch the full video below:\nIf you have any suggestions or feedback for us, we would love to hear from you in the comments."
  },
  {
    "title": "eDC Weekly!",
    "link": "https://edciitdelhi.substack.com/p/edc-weekly-092",
    "published": "Fri, 28 Jul 2023 18:59:43 GMT",
    "content": "Recent Updates with eDC\neDC introduces its team for the upcoming session. Brimming with exceptional talent, passion, and expertise, our members are fueled with boundless enthusiasm to make eDC IIT Delhi bigger and better than ever! Brace yourself for a journey together filled with innovation, growth, and impactful initiatives ahead.\nSFT aka Solve For Tomorrow\nThe Entrepreneurship Cell (eDC) of IIT Delhi partnered with Samsung officials at the Research & Innovation (R&I) Park to conduct \"Solve For Tomorrow\". This collaboration aimed to nurture young entrepreneurs, giving them a unique opportunity to present their innovative ideas to Samsung.\n\"Solve For Tomorrow\" is an initiative by Samsung to promote innovation and support young entrepreneurs in their quest to create impactful solutions. The event attracted enthusiastic participation from the college's entrepreneurial community.\nThroughout the event, participants got the opportunity to attend mentoring sessions, workshops, and seminars conducted by industry experts from various industries. These sessions equipped these young entrepreneurs with valuable insights and knowledge in areas like market analysis, product development, marketing strategies, fundraising, prototyping, and pitch deck making.\nFigmaverse\nThe Figma workshop on product development was a fresh educational endeavour by the club. The workshop was taken by Ibrahim Khan, the ex-director and advisor on the panel of the design club. The workshop dealt with the basics of Figma and was inclusive of all beginners who wished to explore the same. It was a massive success and received participation from students across the country.\nShark Tank India Webinar\nShark Tank India came as a breath of fresh air on Indian television and has continued to garner fame since its conception in 2021. eDC, in collaboration with Shark Tank India, organised an online webinar where participants gained invaluable knowledge about the Indian entrepreneurial scene and operation of the show from Mr. Rahul Hotchandani, Head Business Consultant and Startup Manager at the show.\nNews around the entrepreneurial world!\nSpace startup boom in India \nAs we all know, due to the recent success of Chandrarayan-3, we have suddenly become keen on India’s leap into space.\nSo here we bring to you India’s success in space startups.\nIndia's space startup sector is experiencing an extraordinary upsurge as numerous companies lead the charge with pioneering technologies and services. Fueled by venture capital firms and attracting top talent from prestigious engineering schools, these startups are making remarkable progress. Among the most promising niches for Indian space startups is the domain of small satellites. These cost-effective and versatile spacecraft serve diverse purposes, from Earth observation to telecommunications and navigation.\nSome of the Leading Indian Space startups are Pixxel, Skyroot Aerospace, Agnikul Cosmos, and Bellatrix Aerospace\nWe recommend you surely give a read to the below article:\nhttps://www.nytimes.com/2023/07/04/business/india-space-startups.html?smid=tw-nytimes&smtyp=cur\nReliance Jio and BlackRock team up:\nReliance Industries Ltd.’s financial services arm, Jio Financial Services Ltd. (JFS), and BlackRock have signed an agreement to form a 50:50 joint venture to offer investment solutions. Earlier this month, RIL renamed the financial services business Reliance Strategic Investments as Jio Financial Services, following the completion of the $20 billion demerger of the business. JFS and BlackRock are targeting an initial investment of $150 million each in the joint venture, to be named Jio BlackRock. As a digital-first entity, Jio Financial has shown interest in the lending business as well as other financial services verticals such as insurance, payments, digital broking, and asset management. JFL plans to launch a consumer and merchant lending business based on proprietary data analytics to complement and supplement traditional credit bureau-based underwriting.\nRead more at: \nhttps://www.livemint.com/companies/news/jio-financial-services-blackrock-agree-to-form-joint-venture-to-ernter-india-s-asset-management-industry-11690384306166.html\nWhat is asset management and its market in india? we suggest you to go through this link to know more about this subject\n:  \nhttps://www.investopedia.com/terms/a/assetmanagement.asp\n\"Indian Fintech Industry Defies Odds”\nThe first half of 2023 saw a substantial drop of 67% in investments in Indian fintech start-ups. Despite the decline, the Indian fintech industry remained the third-highest-funded in the world. Payment, alternative lending, and internet-first insurance platforms were the top-performing segments in the fintech sector during the period. IPV, Blume Ventures, and Titan Capital were the top investors in seed stage rounds, while Elevar Equity, TPG, and Peak XV Partners were the top investors in the early stages. The articles give intricate insights about the course of events and how the sector stayed afloat against these challenges.\nRead more at: \nhttps://www.businesstoday.in/entrepreneurship/start-up/story/indian-fintech-industry-remains-third-highest-funded-in-h1-2023-despite-67-per-cent-drop-391406-2023-07-26\nKnow more about the fintech industry: \nhttps://technosports.co.in/the-top-10-fintech-companies-in-india/\nRise of women-led start-ups:\nSince the dawn of the 21st century, women have achieved remarkable progress in various domains. However, data suggests that the entrepreneurial world still falls short in engaging them adequately. This article delves into the very inspiring journey of women-led startups in India, navigating the gender funding gap and defying all odds. It explores their everyday challenges, the transformative initiatives propelling change, and the potential for economic growth through women's empowerment. We would like to recommend all the readers and entrepreneurially inclined females out there to give it a read.\nRead more:\n \nhttps://indianstartupnews.com/isn-in-depth/women-entrepreneurs-gender-funding-gap-startups-india-financial-empowerment\n \nStart Small, Impact Big:\n  Inspiring Stories of Innovative ‘Startups’\nBallpoint pen:\nWhile writing and calligraphy have existed since ancient times, the ballpoint pen is relatively new. America’s first ballpoint pen, the Reynolds Rocket, went on sale at Gimbels in October 1945; a unit cost about $12.50, or the equivalent of $170 in 2017 dollars. There had been multiple attempts by many people to create a reliable ballpoint pen long before Milton Reynolds did it. A lot of the previous designs were actually good enough, but the Reynolds Rocket was the first to gain commercial success. As more companies started to offer similar products, market competition forced the price to drop significantly in the subsequent years.\nPolaroid camera\n:\nEdwin Land granted the wish that his daughter made in 1943; she wanted to see the photographs her father captured instantly. It took Land just four good years to make it happen. The Land camera was manufactured by Polaroid between 1947 and 1983; it went on sale for the first time in 1948. Not only did he grant his daughter’s wish, but he also made millions over the following decades.\nMovie for the weekend ?\n1. The Founder: \nExplore the journey of Ray Kroc, who turned a small burger joint into the global fast-food giant, McDonald's.\n2. The Social Network:\n \nA biographical drama that portrays the creation of Facebook and the legal battles faced by its founder, Mark Zuckerberg.\n3. Joy:\n Inspired by true events, it showcases the story of Joy Mangano, a self-made millionaire and inventor of the Miracle Mop.\n4.Silicon Valley:\n is A comedy series that follows a group of programmers as they navigate the startup world in Silicon Valley\n5. The Billion Dollar Code (Netflix):\n \nDive into the rise and fall of a German internet startup during the dot-com bubble.\n6. The Playlist (Netflix):\n \nGain insights into Spotify's disruptive journey in the music industry, emphasizing innovation and adaptability.\nCrosswords\nAcross:\n \n[1] \nA short-term loan often used by startups to cover operational expenses. \n[5]\n The process of converting an idea into a marketable product or service. \n[6] \nA person who invests in a startup in exchange for equity ownership. \n[7] \nThe group of individuals or organizations that a business aims to sell its products or services to. (2 words joined)\n[9]\n The legal protection granted to inventions, designs, or processes. \n[10] \nA document that outlines a startup's business concept, target market, and financial projections.(2 words joined)\nDown:\n[2]\n The initial phase of a startup, where the business idea is developed and validated. \n[3]\n A strategy used by startups to rapidly acquire a large user base before focusing on monetization.(2 words joined)\n[4]\n A business model where products or services are provided on a subscription basis.\n[\n8\n] The total value of a company, calculated by subtracting liabilities from assets.(2 words joined)\n[11]\n A technique used to gather feedback and make changes quickly during the product development process.\nThanks for reading eDC weekly! Subscribe for free to receive new posts and support my work.\nSubscribe"
  },
  {
    "title": "eDC Weekly!",
    "link": "https://edciitdelhi.substack.com/p/edc-weekly-f73",
    "published": "Sat, 18 Feb 2023 11:37:44 GMT",
    "content": "As we navigate the challenges of the current times, it's more important than ever to foster a culture of innovation and creativity. With that, we're excited to bring you news and updates on the latest trends and developments in the world of entrepreneurship.\nRecent Updates with eDC\nComing Tuesday, get a chance to learn with Padma Shri Award winner, Mohan Reddy!\nOn 21st of February, all of  you are cordially invited for a session held by eDC, where Padma Shri Awardee Shri BVR Mohan Reddy will be joining us at the Seminar Hall of IIT Delhi. He's the Chairman of the Board of Governors of IIT Hyderabad and IIT Roorkee, serves on the Board of Governors for the Indian School of Business, and is a member of the Board of Trustees for the American India Foundation. He is also the Founding Director of T-Hub, India's largest startup incubation centre, and Ex-Chairman of NASSCOM. Apart from all this, he also plays an active role in promoting innovation and entrepreneurship in India and has been involved in various initiatives to support startups and young entrepreneurs.\nPenguin recently published his book “Engineered in India: From Dreams to Billion-Dollar CYIENT\".  It is a business biography of building Cyient, a successful and sustainable company.\nHope you will all participate in the interactive session and learn from the master himself.\neDC launches its new initiative for Founders Exclusive!\neDC is inviting founders to join their exclusive founder-only community. This community aims to bring together like-minded individuals passionate about entrepreneurship and innovation. As a member of this community, founders will have access to a range of resources and opportunities, including networking events, mentorship sessions, and workshops on various aspects of entrepreneurship. Members will also be able to connect with other successful founders and share their experiences, ideas, and challenges. The community is open to founders from all industries and backgrounds, and there are no restrictions on the stage of their business.\nMusketeers is ON!\nThe first workshop for Musketeers, a freshers exclusive event took place on 27th January, where Professor Gourav Dwivedi, Assistant Professor at DMS, IIT Delhi assisted the students understand about ideation of an Startup. He also elaborated how to identify opportunities, conduct market research and brainstorm. Hands-on exercises and expert guidance were given to take the startup journey from concept to validation.\nNews around the entrepreneurial world!\nBudget 2023 Wrap-Up!\nUnion Finance Minister Nirmala Sitharaman on February 1st presented the Union Budget 2023, the fifth budget of Modi 2.0. In the last full-fledged Budget before the general elections next year, Nirmala Sitharaman said that the Indian economy is on the right path and heading towards a bright future. In a big boost for taxpayers and the economy, Sitharaman announced major changes in tax slabs under the new tax regime and a big hike in allocation for railways and capital expenditure.\nMobile phones, TV, Lab-grown diamonds, Shrimp feed, Machinery for lithium-ion batteries, and Raw materials for the EV industry get cheaper whereas Cigarettes, Silver, Compounded rubber, Imitation Jewellery, Articles made from gold bars, Imported bicycles and toys, Imported kitchen electric chimney, and Imported luxury cars and EVs get costlier.\nMajor Highlights:\nFiscal position\n: Fiscal Deficit targeted to be below 4.5 percent by 2025-26.\nRailways get a Massive Boost:\n An outlay of Rs 2.4 lakh crore provided for railways in FY24, the highest ever allocation for Railways and is nearly nine times over FY14 allocations. The Railways is likely to roll out 75 Vande Bharat trains by August 2023.\nDefence Budget hiked by 13%\n: Rs 1.62 lakh crore set aside for capital expenditure including purchases of new weapons, aircraft, warships and other military hardware.\nJobs:\n Government will launch Pradhan Mantri Kaushal Vikas Yojana 4.0. Direct Benefit Transfer under a pan-India National Apprenticeship Promotion Scheme to be rolled out to provide stipend support to 47 lakh youth in three years.\nClean Energy:\n Rs 35,000 crores priority capital for the energy transition\nNational Green Hydrogen mission with an outlay of Rs 19,700 crore will facilitate the transition of the economy to low carbon intensity, reduce dependence on fossil fuel imports and make the country assume technology and market leadership\nAviation & Highways:\n 50 additional airports, helipads, water aero drones, and advanced landing grounds will be revived to improve regional air connectivity.\nHealth:\n Health sector has been allocated Rs 89,155 crore in the Union Budget. \nThe allocation for the National Digital Health Mission – NHM has been increased from Rs 140 crore to Rs 341.02 crore.\nEducation:\n Three centres of excellence for artificial intelligence to be set up in top educational institutions. \nCentral Universities have been increased by 17.66%, Deemed University by 27%, support to IITs have been increased by 14%, and to NITs by 10.5% as compared to BE 2022-23.\nSports:\n Sports gets an allocation of Rs 3,397.32 crore, an increase of Rs 723.97 crore and is the highest sports budget allocation ever in the country.\nThe budget claims to aim at facilitating ample opportunities for citizens, especially youth and providing a strong impetus to growth and job creation. A special emphasis has been given to areas like clean and renewable energy, health, sports and railways and priorities seem to set foundational metrics right while ensuring sustainable growth. A robust, and efficient implementation shall only reveal the corresponding intent and outcome of these visions laid forth in due time.\nAdani-Hindenburg Case Latest Update: Supreme Court rejects names proposed by centre\nThe Supreme Court of India has rejected the names proposed by the government for a committee to investigate the recent controversy surrounding Adani Group's dealings. The Adani Group was accused of inflating prices and evading taxes by the Hindenburg Research, an investment research firm. In response, the Indian government proposed a committee that included officials who had previously worked for the Adani Group. The Supreme Court has now ordered the formation of a new committee consisting of independent experts to investigate the matter. The decision is being hailed by critics as a victory for transparency and accountability in the country's business dealings. The case has attracted international attention, with many investors watching closely to see how it will be resolved.\nChatGPT - the rivalry between big companies!\nOpenAI's ChatGPT language model has revived the search competition between Microsoft's Bing and Google. ChatGPT's advanced natural language processing capabilities pose a threat to Google's search engine monopoly. Microsoft has integrated ChatGPT into Bing, offering users faster and more accurate results. Meanwhile, Google is working on enhancing its AI-powered search engine to compete with Bing. All this chaos implies one thing for sure, the future of search is set to become more intelligent and exciting due to advancements in AI technology.\nBook recommendations for our aspiring entrepreneurs!\n\"Zero to One\" by Peter Thiel \n- In this book, Thiel explores the concept of creating new, innovative businesses and shares insights from his experiences co-founding companies like PayPal.\n\"The 7 Habits of Highly Effective People\" by Stephen R. Covey \n- While not specifically focused on entrepreneurship, this classic book provides practical advice on personal and professional development that can benefit any business leader.\n\"The Lean Startup\" by Eric Ries\n - This book offers practical advice for creating and running a successful startup by focusing on efficiency and experimentation.\nQuestion of the Week!\nHave you ever considered the role of a venture capitalist in the modern startup world? What role do VCs play beyond acting as an ATM for founders and their company?\nIndeed, the responsibilities of VC span a wide range of business operations. To begin, a venture capitalist is an individual or a firm that invests capital in early-stage companies with high growth potential in exchange for equity or an ownership stake. The role of a venture capitalist is to provide capital, strategic support, networking and access, due diligence, and ongoing monitoring and mentorship to early-stage companies with high growth potential. VCs are willing to risk investing in such companies because they can earn a massive return on their investments if these companies are a success. However, VCs experience high rates of failure due to the uncertainty that is involved with new and unproven companies. Wealthy individuals, insurance companies, pension funds, foundations, and corporate pension plans may pool money into a VC-controlled fund. The VC firm invests the fund, usually in riskier firms or ventures, but all partners own part of it. The venture capital firm is the general partner and the others are limited partners. It is by leveraging their expertise, experience, and network, they help startups transform their ideas into successful businesses.\nThat’s all folks for this week! If you were fascinated by our work and want to work with us, fill this\n form\n. Till then, keep thinking, keep asking, and have a safe stay. Bbye!\nThanks for reading! Subscribe to receive weekly updates about entrepreneurship around you!\nSubscribe"
  },
  {
    "title": "eDC Weekly! Ft. BECon'23 special!",
    "link": "https://edciitdelhi.substack.com/p/edc-weekly-ft-becon23-special",
    "published": "Thu, 05 Jan 2023 17:25:18 GMT",
    "content": "Kaboom! The time has come! IIT Delhi’s annual Business and Entrepreneurship Conclave is here starting tomorrow, and we have loads of speakers, events, competitions, and here is a quick glimpse of it!\nBECon’23! The website is live!\nWhat is BECon'23? IIT Delhi's annual Business and Entrepreneurship Conclave, scheduled to take place on the sixth, seventh, and eighth of January, is right here. BECon at IIT Delhi is India's largest entrepreneurial conference, receiving a footfall of 50,000+ students from more than 500 different institutes. BECon serves as a platform to bring together the world's top business experts, entrepreneurs, and change-makers and connect them to a larger audience of students and future leaders.\nWe would love all of you to go through our website, \nhttps://edc.iitd.ac.in/becon/\n where you can look at all the events taking place in the next three days.\nPre-BECon’23\nBECon'23 started with a bang when the cast of the popular web series TVF Pitchers came to IIT Delhi to connect with students as part of a pre-fest event. Pitchers is a story that resonated with countless individuals and inspired them to follow their entrepreneurial ambitions. The Seminar Hall of IIT Delhi was alighted by the presence of star-casts Naveen Kasturia (Actor), Arunabh Kumar (Actor, Creator, and Producer), Vaibhav Bundhoo (Director), and Ridhi Dogra (Actor).\nThe session ended with participants clicking photos with the stars, and the stars gave a heartwarming introduction for the fest BECon'23. You can find the \nreel\n on our insta page, edc_iitd.\nInauguration\nThe inauguration event of the galactic event will witness stellar guests coming from spheres of public welfare, media & journalism and inaugurate the event on Friday, 6th January in Dogra Hall. Smt Meenakshi Lekhi, Hon’ble Minister Of State For External Affairs and Culture, Member of Parliament from New Delhi Parliamentary Constituency along with Mr. Avinash Pandey, CEO Of ABP News and President, NBDA would be the chief guests for the day. Prof. Rangan Banerjee, Director, IITD would also grace the occasion and unveil the curtains for the mega event. The show will witness the guests speak about their journeys, and essential insights, and surely be a great sight for the enthusiastic young sparks seated. The waves of entrepreneurship have washed ashore, what are you waiting for?\nSpeaker Sessions \nComing onto one of the most exciting and cherishable sequences of events, the ones which hook you forever with their impressionable wisdom and starry charm, the ones you always wished to get a chance to see, absorb and hold on to forever…. The chance to witness your icons, your role models is finally here with BECON hosting a number of guests across industries who all made it big to where they are today. \nSandeep Aggarwal, a serial entrepreneur who founded two unicorns back to back, ShopClues and later Droom, will be having his session on 7 Jan 2-3 PM, which you definitely don’t wish to miss. Ankush Singla, Sandeep Jain Founders of CodingNinjas and GeekForGeeks respectively, Raghav Verma, and Amit Agrawal Cofounders and CEO of Chaayos and NoBroker are just a few names out of several starry others this segment holds for you.\nFlagship Events\nShark Tank\nShark Tank is an event made to empower budding entrepreneurs by providing a platform to pitch in front of India's top investors. Startups will have the opportunity to receive INR 3 million on-spot funding from leading investors and will receive personalized inputs to help them correct their mistakes and evolve. \nShark Tank 3.0 will witness the premier investors of India, the likes of Venture Catalysts, Indian Angel Network, 100x.vc, IVY Growth, Startup Lanes, PedalStart, India Accelerator, Kansaltancy Ventures, and Convanto would be deciding whether they would like to invest in the ideas. \nFind your Cofounder\nThis event presents you with a novel situation wherein you will be asked to pitch ‘yourself’ and let your drive and desire do the talking!\nThe process is fairly simple and requires you to fill out a form with relevant skills (technical, soft skills), courses undertaken, and start-up ideas if thought of any. The shortlisted few will then be asked to present their 1-minute elevator pitch, highlighting their skills as a founder.\nHere’s the fun part! After the pitches are over, the founders will choose up to five people to match with, and the participants with the highest approval voting will be the ones grabbing the top sweet prizes!\nSo grab the opportunity, and let the founder within be freed and fully expressed!\nOne day CEO Competition\nBECon’23 brings you another flagship event, One Day CEO Challenge. If you are vigilant enough to lead a firm and want to nurture your inner entrepreneur, then here is your chance to come and showcase your skills. This competition is carefully designed to test every aspect, from critical thinking to be able to socialize and network. Being one of the most awaited events of BECON’23, it pushes you to the limits, ending with unparalleled rewards, in addition to the memory and accolades.\nB-plan 2.0 competition \nBECon provides a hearty welcome to all entrepreneur enthusiasts to come in teams of 1-4 members. The event will be based on solving a real life business case study and it will be conducted in hybrid mode and there will be lucrative prizes for the winners.\nCompetitions with Cultural clubs of IIT Delhi\nDeveloping multiple skills is an inherent part of entrepreneurial journey and to help you develop these eDC IIT Delhi in association with other clubs and societies of IIT Delhi brings to you plethora of events and competitions like start-up the debate, Learning the Troops, Founder’s desk, Bizz Art, etc. These events make you think creatively and make you practice some new skills. So register and experience entrepreneurship through different lens.\nClosing Ceremony\nOn 8th January, we’ll culminate the event with an award show, followed by a creative arts performance to lighten the evening. Thereafter we’ll move to the much-awaited stand-up comedy show by one of the most loved performers Vipul Goyal, who is an IIT Alumnus himself. In the grand scheme of events crafted just for you, this closing ceremony will certainly be the grandest amongst anything you have witnessed do far!\nWe hope you have a glamourous three days in BECon’23!\nThanks for reading! Subscribe to receive weekly updates about entrepreneurship around you!\nSubscribe"
  },
  {
    "title": "eDC Weekly!",
    "link": "https://edciitdelhi.substack.com/p/edc-weekly-70a",
    "published": "Sat, 08 Oct 2022 13:48:10 GMT",
    "content": "Hola! We are back with the second edition of eDC Weekly. Just like every edition, this time also we hop onto the ongoing entrepreneurial changes happening in and around us. Read more to find out!\nRecent Updates with eDC\nUnicorn Series has begun! \n- Oct 1st, 2022\nThe \"Unicorn Series\" is a brand-new series put on by eDC-IIT Delhi along with IIT Delhi Alumni Association, aiming to help and encourage young minds at IIT Delhi to pursue and succeed in entrepreneurship. The Unicorn Series seeks to foster entrepreneurial potential by having interactive sessions with IIT Delhi alums, who will provide essential insights and help students turn their entrepreneurial ideas into successful firms.\nFor the first session of the Unicorn Series, we had Mr. Vidit Aatrey, the founder and CEO of Meesho. He completed his BTech in Electrical Engineering from IIT Delhi in 2012. Even though he worked for ITC and InMobi, his desire to be an entrepreneur ensured that he did something of his own. Since 2015, he has done a tremendous amount of hard work to turn Meesho into a unicorn. In the session, he touched upon his childhood days and how he came up with the idea to start Meesho with his hostel wingmate, now his fellow cofounder, Mr. Sanjeev Barnwal. He asked all budding entrepreneurs to learn from their failures and manage their emotions in case of failure. \nThe session was moderated by Mr. Gaurav Goyal, Treasurer, IITDAA and Covener of the Startup Sub Committee. Ms. Punam Lade, EC Member, IITDAA and the Startup Sub Committee member, thanked Mr. Vidit Aatrey for taking his time out for this eventful session.\nXR Startup Program - \nOct 7th, 2022\nExtended Reality Technologies (XR) have never been more exciting than before. This umbrella tech encompassing augmented reality (AR), virtual reality (VR) and mixed reality (MR) is a growing force to solving modern day problems with a futuristic touch.\neDC-IIT Delhi, along with FITT-IIT Delhi, organised XR Startup Program in collaboration with Meta and MeitY Startup Hub (MSH), Ministry of Electronics and Information Technology, GoI. A panel discussion was held about exploring the potential of XR across various domains, such as healthcare and education. The program aimed to accelerate and nurture the development of Extended Reality (XR) technologies in India. With an eye on the metaverse buzz and the crazy developments following up, this is indeed a great learning experience.\nNews around the entrepreneurial world!\nGovt Launched SETU Initiative To Empower Indian Startups\nUnion Minister for Commerce and Industry, Piyush Goyal launched an initiative called SETU in San Francisco, California. SETU stands for Supporting Entrepreneurs in Transforming and Upskilling. SETU aims to connect Indian entrepreneurs and startups to US investors and is designed to break the geographical barriers between mentors based in the US that are willing to invest in sunrise sectors in India. The Interaction between the American investors and Indian startups will be supported through MAARG which is Mentorship, Advisory, Assistance, Resilience, and Growth program. It is a mentorship portal under the Start-up India initiative. The portal has been developed with the idea to be accessible from every corner of the country to connect with a mentor. The initiative will offer human intelligence to guide startups. Globally, more than 200 mentors have been connected to MAARG.\nShri Piyush Goyal - Ministry of Commerce and Industry\nThe Fall of Pound\nThe announcement of tax cuts Britain's government brought havoc in their currency by dropping the pound's value to $1.03, the lowest level pound has ever been against the dollar, raising concerns of even higher inflation. Experts say the pound declined so sharply because many investors are wary of British Prime Minister Liz Truss's proposal to increase government borrowing to pay for tax cuts. \nHow is the UK affected by it? Oil & Gas is one of the key imports for the UK, and it is priced in dollars on international commodity markets. A weaker pound would make diesel or petrol more expensive. Also, since the United Kingdom imports more than fifty percent of its food, food prices will increase. How does this affect foreign nations? It makes UK goods and services more affordable!\nSource: Bloomberg\nFun Trivia\nThe term entrepreneur originates from the French verb \"entreprendre\", which means “to initiate, to begin, to start, to create, to embrace”.\nSpeaking of the entrepreneur's work-life balance – it is about how many hours per week a person works? A study conducted by 80000hours.org shows:\n•\t19% of entrepreneurs work over 60 h/week\n•\t30% of entrepreneurs work around 51-59 h/week\n•\t33% of entrepreneurs work 40-50 h/week\n•\t14% of entrepreneurs work 30-39 h/week\n•\tonly 5% work less than 30 h/week\nWhere do you think you would stand?\nQuestion of the week!\nSo here we are with the question we left you with last time! \nDeferred Placement Program: \nThe Deferred Placement Program here at IITD is an iconic opportunity for bright young minds seeking a plunge into entrepreneurship. This program, open to pre-final B.Tech, Dual degree, or M.Tech students shortlists promising startup ventures, and offers the students an option of deferring their placement for two years.\nThe shortlisting is done by an esteemed panel consisting of faculty members and industry experts, which later will consistently monitor the team’s progress. Besides helping in availing of key guidance and funding, the panel will help the team on legal and entrepreneurial matters. There is no upper cap on the number of students availing of this benefit which irrespective of the outcome, supports the student in mitigating the risk associated with the process and helps realize true ambitions.\nFor more details, refer to the \nOfficial Program Circular.\nHave you been overwhelmed by the number of clubs at IITD? Or do you feel they are fewer, and you wish to come up with a club of your own? IITD offers you the freedom to do so but wait, how exactly do you do it? Have you ever thought of it?\nStay tuned till next week until we share you the answer. If you were fascinated by our work and want to work with us, fill this\n form\n. Till then, keep thinking, keep asking, and have a safe stay. Bbye!\nThanks for reading! Subscribe to receive weekly updates about entrepreneurship around you!\nSubscribe"
  },
  {
    "title": "eDC weekly",
    "link": "https://edciitdelhi.substack.com/p/edc-weekly",
    "published": "Thu, 22 Sep 2022 13:43:10 GMT",
    "content": "“Twenty years from now, you will be more disappointed by the things that you didn’t do than by the ones you did do. So throw off the bowlines. Sail away from the safe harbor. Catch the trade winds in your sails. Explore. Dream. Discover.” - Mark Twain\nIn this saga of exploration, of challenging yourself and discovering the possibilities that lie within, eDC brings you its much-awaited reader’s digest! eDC aims to make you more informed and aware of the things that surround you, impact you in severe or subtle ways and serve a plethora of budding news and ideas to keep you well updated. With curated content every week, we ensure that you, ~\nthe entrepreneur~\n are well informed about the latest trends to the latest successes, rises and falls amidst the mighty battles fought within and beyond these campus walls. Business News, Tech, Entrepreneurial happenings or be it any event at the campus, we have got you all covered. So just dive right in and \nhappy reading!\nRecent updates with eDC\nMad for Ad - \nSept 4th, 2022\nIn a fresh wave of Entrepreneurial Extravaganza at IITD, eDC hosted one of its first kind – an Inter-hostel Advertisement Making competition- Mad For Ad! Sponsored by Tech Partner Metaschool and presided over by Mr. Sushant Sharma- Brand Manager, Boat; the event witnessed 13 hostel-teams battle out their marketing and presentation skills with creativity and flamboyance. Each team was given two choices of the brands they wished to present and fight for, the Ad being 1 min in length and the following pitch to be wrapped up in 3 mins. The key metrics were originality, the intent behind the concept, creativity, and most importantly the impact in ideal market conditions. Mr. Sushant spared no efforts in acknowledging and appreciating the team’s efforts and giving them their due feedback. Amidst forceful branding was also fiery cheering from all hostels, without which the event wouldn’t have been lively for all. Girnar hostel clinched the title and bagged the meaty prize money, with Satpura and Kailash following next.\nAll in all, a spectacular event to kickstart the year with a bang, get ready for many more such events, this is just the beginning!\npic credits: Harshal Gupta, Garv Gupta\nSamsung Solve For Tomorrow - \nSeptember 17th,2022\nSolve For Tomorrow, a Samsung initiative to encourage students to incorporate design thinking into corporate strategy, was held at IITD from the 15th to the 17th of September. On the occasion of Engineer's day, Samsung Korea's R&D Managing Director and the Director of IIT Delhi came along to inaugurate the event. It was an innovation contest inviting India's brightest young minds to craft creative ideas that can transform the lives of people around them. The event attracted a large number of students from schools and colleges throughout the country. Each team was allotted two mentors, one from M.Design and another from eDC. Students were introduced to various business model canvases by their mentors. You could see the sparkle in their eyes, and interacting with them was a blessing. The students pitched their creative startup ideas revolving around one of the four target sectors; healthcare, agriculture, education and environment, which were judged by a panel of 12 Samsung R&D institute experts with diverse backgrounds in technology and innovation.\npic credits: Gargi Gupta\nHard Skill Workshops by eDC\neDC started off the tenure with its hard-skill workshops series by having a session on ‘Personal Finances’ where Shashank Jha gave his valuable tips on managing personal finances. The session summarized various investment options and provided a precise analysis of the return on investment, the risk factors involved, and how beginners could start investing in stocks, cryptos and other mutual funds. Over 100 students participated in the session, which gave them the confidence to begin their financial journey.\nIn part two of the hard skill workshop series, Satyam Kesari, product manager at STEPapp, touched on several key aspects of product management, the nature of the role and the skills required to go about if you wish to become one. Surely, being one of the most strategic roles in a corporation, unravelling the intricacies was a must and was well executed in the end. The participants had a very good experience, and the takeaways are also worth noting, which have already been uploaded on eDC Instagram handle.\nStartup Nukkad is now open for all!\nEver got a crazy idea or some enthralling news about the startup universe, but have to keep it in your stomach as there's no one to discuss it with?\neDC is coming up with a weekly \"Nukkad Startup\" initiative, where startup enthusiasts like you will gang up to discuss ideas in a \"chill sa environment\". \nAt the Nukkad, we will not only mull over the ideas but discuss \"literally anything\" that connects to entrepreneurship, be it \"What is it that makes Cred such a success?\" or the discussions about the new startups coming from IIT Delhi itself. Occasionally we will conduct synergistic sessions with external guests.\nSo whether you have got something to discuss or want to be updated in this fast pacing universe of startups, worry not, eDC has got you covered. Last week, we had \nDeepit Patil\n, an ex—eDC member, whose startup has already been incubated by Y-combinator.\nJoin us at the Nukkad \nevery Friday\n to learn, grow and enjoy.\nPic credits: Harshal Gupta\nNews around the entrepreneurial world!\nEthereum Merge is successful!\nThe Ethereum Merge countdown ended last week on 15 September 2022, bringing a pivotal change in the crypto market. The replacement of proof-of-work, the more energy-intensive process pioneered by Bitcoin, with proof-of-stake on the Ethereum blockchain was one of the most consequential events in the history of cryptocurrencies, which is believed to cut the network's energy consumption by 99 percent. However, it is believed that Ethereum transaction costs should remain unchanged after the merge, but Ethereum's high network fees may be reduced through danksharding and proto-danksharding as early as 2023.\nTech incubator T-Hub launches new cohort for semiconductor startups:\nT-Hub launched the semiconductor saga of its AIC T-Hub Foundation Programme in partnership with Qualcomm and CITD to foster innovation and entrepreneurship across the industry where India for long seeks to bridge the requisite demand and become self-sustainable. This six-month hybrid program will mentor 20 startups with potentially innovative ideas that could transform supply chains through expert-led workshops, specialized mentorships, market access, and much more.\nEver wondered the first job of billionaires?\n We have brought a list for you.\nElon Musk($253B): \nSoftware Engineer\n at Zip2\nJeff Bezos($165B): \nFry cook\n at McDonalds\nGautam Adani($126B): \nDiamond Sorter\n at Mahendra Brothers\nBill Gates($121B): \nComputer Programmer\n for TRW\nWarren Buffet($103B):\n \nNewspaper Delivery Guy\n \nfor Washington Post\nNo matter how small you start, start something that matters!\nQuestion of the week!\nHave you heard about deferred placements in IIT Delhi?\n What is it and why is it important for budding entrepreneurs?\nStay tuned till next week until we share you the answer. Liked our newsletter? Take some time out to fill this \nform\n. Till then, keep thinking, keep asking, and have a safe stay. Bbye!\nThanks for reading! Subscribe to receive weekly updates about entrepreneurship around you!\nSubscribe"
  },
  {
    "title": "Coming soon",
    "link": "https://edciitdelhi.substack.com/p/coming-soon",
    "published": "Wed, 14 Sep 2022 14:10:20 GMT",
    "content": "This is EDC Newsletter\n, a newsletter about current entrepreneurial affairs in the campus and around the country..\nSubscribe"
  }
]